<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML
><HEAD
><TITLE
>System and Administrative Commands</TITLE
><META
NAME="GENERATOR"
CONTENT="Modular DocBook HTML Stylesheet Version 1.64
"><LINK
REL="HOME"
TITLE="Advanced Bash-Scripting Guide"
HREF="index.html"><LINK
REL="UP"
TITLE="Beyond the Basics"
HREF="part3.html"><LINK
REL="PREVIOUS"
TITLE="Miscellaneous Commands"
HREF="extmisc.html"><LINK
REL="NEXT"
TITLE="Command Substitution"
HREF="commandsub.html"><META
HTTP-EQUIV="Content-Style-Type"
CONTENT="text/css"><LINK
REL="stylesheet"
HREF="common/kde-common.css"
TYPE="text/css"><META
HTTP-EQUIV="Content-Type"
CONTENT="text/html; charset=iso-8859-1"><META
HTTP-EQUIV="Content-Language"
CONTENT="en"><LINK
REL="stylesheet"
HREF="common/kde-localised.css"
TYPE="text/css"
TITLE="KDE-English"><LINK
REL="stylesheet"
HREF="common/kde-default.css"
TYPE="text/css"
TITLE="KDE-Default"></HEAD
><BODY
CLASS="CHAPTER"
BGCOLOR="#FFFFFF"
TEXT="#000000"
LINK="#AA0000"
VLINK="#AA0055"
ALINK="#AA0000"
STYLE="font-family: sans-serif;"
><DIV
CLASS="NAVHEADER"
><TABLE
WIDTH="100%"
BORDER="0"
CELLPADDING="0"
CELLSPACING="0"
><TR
><TH
COLSPAN="3"
ALIGN="center"
>Advanced Bash-Scripting Guide: An in-depth exploration of the art of shell scripting</TH
></TR
><TR
><TD
WIDTH="10%"
ALIGN="left"
VALIGN="bottom"
><A
HREF="extmisc.html"
>Prev</A
></TD
><TD
WIDTH="80%"
ALIGN="center"
VALIGN="bottom"
></TD
><TD
WIDTH="10%"
ALIGN="right"
VALIGN="bottom"
><A
HREF="commandsub.html"
>Next</A
></TD
></TR
></TABLE
><HR
ALIGN="LEFT"
WIDTH="100%"></DIV
><DIV
CLASS="CHAPTER"
><H1
><A
NAME="SYSTEM"
>Chapter 13. System and Administrative Commands</A
></H1
><P
>The startup and shutdown scripts in 
	<TT
CLASS="FILENAME"
>/etc/rc.d</TT
> illustrate the uses
	(and usefulness) of many of these comands. These are usually
	invoked by root and used for system maintenance or emergency
	filesystem repairs. Use with caution, as some of these commands
	may damage your system if misused.</P
><DIV
CLASS="VARIABLELIST"
><P
><B
><A
NAME="USERSGROUPS1"
></A
>Users and Groups</B
></P
><DL
><DT
><B
CLASS="COMMAND"
>chown</B
>, <B
CLASS="COMMAND"
>chgrp</B
></DT
><DD
><P
>The <B
CLASS="COMMAND"
>chown</B
> command changes the
	      ownership of a file or files. This command is a useful
	      method that <TT
CLASS="REPLACEABLE"
><I
>root</I
></TT
> can use to
	      shift file ownership from one user to another. An ordinary
	      user may not change the ownership of files, not even her
	      own files.
	         <A
NAME="AEN8800"
HREF="#FTN.AEN8800"
>[1]</A
>
	      </P
><P
>	      <TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="90%"
><TR
><TD
><PRE
CLASS="SCREEN"
> <TT
CLASS="PROMPT"
>root# </TT
><TT
CLASS="USERINPUT"
><B
>chown bozo *.txt</B
></TT
>
 <TT
CLASS="COMPUTEROUTPUT"
></TT
>
 	      </PRE
></TD
></TR
></TABLE
>
	    </P
><P
>The <B
CLASS="COMMAND"
>chgrp</B
> command changes the
	      <TT
CLASS="REPLACEABLE"
><I
>group</I
></TT
> ownership of a file or
	      files. You must be owner of the file(s) as well as a member
	      of the destination group (or <TT
CLASS="REPLACEABLE"
><I
>root</I
></TT
>)
	      to use this operation.
	      <TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="90%"
><TR
><TD
><PRE
CLASS="PROGRAMLISTING"
>   1&nbsp;chgrp --recursive dunderheads *.data
   2&nbsp;#  The "dunderheads" group will now own all the "*.data" files
   3&nbsp;#+ all the way down the $PWD directory tree (that's what "recursive" means).</PRE
></TD
></TR
></TABLE
></P
></DD
><DT
><B
CLASS="COMMAND"
>useradd</B
>, <B
CLASS="COMMAND"
>userdel</B
></DT
><DD
><P
>The <B
CLASS="COMMAND"
>useradd</B
> administrative command
	      adds a user account to the system and creates a home
	      directory for that particular user, if so specified. The
	      corresponding <B
CLASS="COMMAND"
>userdel</B
> command removes
	      a user account from the system
		 <A
NAME="AEN8831"
HREF="#FTN.AEN8831"
>[2]</A
>
	      and deletes associated files.</P
><DIV
CLASS="NOTE"
><TABLE
CLASS="NOTE"
WIDTH="90%"
BORDER="0"
><TR
><TD
WIDTH="25"
ALIGN="CENTER"
VALIGN="TOP"
><IMG
SRC="common/note.png"
HSPACE="5"
ALT="Note"></TD
><TD
ALIGN="LEFT"
VALIGN="TOP"
><P
>The <B
CLASS="COMMAND"
>adduser</B
> command is a synonym
	      for <B
CLASS="COMMAND"
>useradd</B
> and is usually a symbolic link to
	      it.</P
></TD
></TR
></TABLE
></DIV
></DD
><DT
><A
NAME="IDREF"
></A
><B
CLASS="COMMAND"
>id</B
></DT
><DD
><P
>The <B
CLASS="COMMAND"
>id</B
> command lists the real and
	      effective user IDs and the group IDs of
	      the current user.  This is the counterpart
	      to the <A
HREF="variables2.html#UIDREF"
>$UID</A
>,
	      <A
HREF="variables2.html#EUIDREF"
>$EUID</A
>, and <A
HREF="variables2.html#GROUPSREF"
>$GROUPS</A
> internal Bash
	      variables.</P
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="90%"
><TR
><TD
><PRE
CLASS="SCREEN"
> <TT
CLASS="PROMPT"
>bash$ </TT
><TT
CLASS="USERINPUT"
><B
>id</B
></TT
>
 <TT
CLASS="COMPUTEROUTPUT"
>uid=501(bozo) gid=501(bozo) groups=501(bozo),22(cdrom),80(cdwriter),81(audio)</TT
>
 
 <TT
CLASS="PROMPT"
>bash$ </TT
><TT
CLASS="USERINPUT"
><B
>echo $UID</B
></TT
>
 <TT
CLASS="COMPUTEROUTPUT"
>501</TT
></PRE
></TD
></TR
></TABLE
><P
>Also see <A
HREF="variables2.html#AMIROOT"
>Example 9-4</A
>.</P
></DD
><DT
><A
NAME="WHOREF"
></A
><B
CLASS="COMMAND"
>who</B
></DT
><DD
><P
>Show all users logged on to the system.</P
><P
>	      <TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="90%"
><TR
><TD
><PRE
CLASS="SCREEN"
> <TT
CLASS="PROMPT"
>bash$ </TT
><TT
CLASS="USERINPUT"
><B
>who</B
></TT
>
 <TT
CLASS="COMPUTEROUTPUT"
>bozo  tty1     Apr 27 17:45
 bozo  pts/0    Apr 27 17:46
 bozo  pts/1    Apr 27 17:47
 bozo  pts/2    Apr 27 17:49</TT
>
 	      </PRE
></TD
></TR
></TABLE
>
	    </P
><P
>The <TT
CLASS="OPTION"
>-m</TT
> gives detailed information about
	      only the current user. Passing any two arguments to
	      <B
CLASS="COMMAND"
>who</B
> is the equivalent of <B
CLASS="COMMAND"
>who
	      -m</B
>, as in <B
CLASS="COMMAND"
>who am i</B
> or <B
CLASS="COMMAND"
>who
	      The Man</B
>.</P
><P
>	      <TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="90%"
><TR
><TD
><PRE
CLASS="SCREEN"
> <TT
CLASS="PROMPT"
>bash$ </TT
><TT
CLASS="USERINPUT"
><B
>who -m</B
></TT
>
 <TT
CLASS="COMPUTEROUTPUT"
>localhost.localdomain!bozo  pts/2    Apr 27 17:49</TT
>
 	      </PRE
></TD
></TR
></TABLE
>
	    </P
><P
><A
NAME="WHOAMIREF"
></A
><B
CLASS="COMMAND"
>whoami</B
> is similar to <B
CLASS="COMMAND"
>who
	      -m</B
>, but only lists the user name.</P
><P
>	      <TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="90%"
><TR
><TD
><PRE
CLASS="SCREEN"
> <TT
CLASS="PROMPT"
>bash$ </TT
><TT
CLASS="USERINPUT"
><B
>whoami</B
></TT
>
 <TT
CLASS="COMPUTEROUTPUT"
>bozo</TT
>
 	      </PRE
></TD
></TR
></TABLE
>
	    </P
></DD
><DT
><B
CLASS="COMMAND"
>w</B
></DT
><DD
><P
>Show all logged on users and the processes belonging to them. This is
	      an extended version of <B
CLASS="COMMAND"
>who</B
>. The output of <B
CLASS="COMMAND"
>w</B
>
	      may be piped to <B
CLASS="COMMAND"
>grep</B
> to find a specific user and/or process.</P
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="90%"
><TR
><TD
><PRE
CLASS="SCREEN"
> <TT
CLASS="PROMPT"
>bash$ </TT
><TT
CLASS="USERINPUT"
><B
>w | grep startx</B
></TT
>
 <TT
CLASS="COMPUTEROUTPUT"
>bozo  tty1     -                 4:22pm  6:41   4.47s  0.45s  startx</TT
></PRE
></TD
></TR
></TABLE
></DD
><DT
><B
CLASS="COMMAND"
>logname</B
></DT
><DD
><P
>Show current user's login name (as found in
	      <TT
CLASS="FILENAME"
>/var/run/utmp</TT
>). This is a
	      near-equivalent to <A
HREF="system.html#WHOAMIREF"
>whoami</A
>,
	      above.</P
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="90%"
><TR
><TD
><PRE
CLASS="SCREEN"
> <TT
CLASS="PROMPT"
>bash$ </TT
><TT
CLASS="USERINPUT"
><B
>logname</B
></TT
>
 <TT
CLASS="COMPUTEROUTPUT"
>bozo</TT
>
 
 <TT
CLASS="PROMPT"
>bash$ </TT
><TT
CLASS="USERINPUT"
><B
>whoami</B
></TT
>
 <TT
CLASS="COMPUTEROUTPUT"
>bozo</TT
></PRE
></TD
></TR
></TABLE
><P
>However...</P
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="90%"
><TR
><TD
><PRE
CLASS="SCREEN"
> <TT
CLASS="PROMPT"
>bash$ </TT
><TT
CLASS="USERINPUT"
><B
>su</B
></TT
>
 <TT
CLASS="COMPUTEROUTPUT"
>Password: ......</TT
>
 
 <TT
CLASS="PROMPT"
>bash# </TT
><TT
CLASS="USERINPUT"
><B
>whoami</B
></TT
>
 <TT
CLASS="COMPUTEROUTPUT"
>root</TT
>
 <TT
CLASS="PROMPT"
>bash# </TT
><TT
CLASS="USERINPUT"
><B
>logname</B
></TT
>
 <TT
CLASS="COMPUTEROUTPUT"
>bozo</TT
></PRE
></TD
></TR
></TABLE
></DD
><DT
><A
NAME="SUREF"
></A
><B
CLASS="COMMAND"
>su</B
></DT
><DD
><P
>Runs a program or script as a
	    <I
CLASS="EMPHASIS"
>s</I
>ubstitute <I
CLASS="EMPHASIS"
>u</I
>ser.
	    <B
CLASS="COMMAND"
>su rjones</B
> starts a shell as user
	    <I
CLASS="EMPHASIS"
>rjones</I
>. A naked <B
CLASS="COMMAND"
>su</B
>
	    defaults to <I
CLASS="EMPHASIS"
>root</I
>.  See <A
HREF="contributed-scripts.html#FIFO"
>Example A-11</A
>.</P
></DD
><DT
><B
CLASS="COMMAND"
>users</B
></DT
><DD
><P
>Show all logged on users. This is the approximate
	      equivalent of <B
CLASS="COMMAND"
>who -q</B
>.</P
></DD
><DT
><B
CLASS="COMMAND"
>ac</B
></DT
><DD
><P
>Show users' logged in time, as read from
	      <TT
CLASS="FILENAME"
>/var/log/wtmp</TT
>. This is one of the GNU
	      accounting utilities.</P
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="90%"
><TR
><TD
><PRE
CLASS="SCREEN"
> <TT
CLASS="PROMPT"
>bash$ </TT
><TT
CLASS="USERINPUT"
><B
>ac</B
></TT
>
 <TT
CLASS="COMPUTEROUTPUT"
>        total       68.08</TT
></PRE
></TD
></TR
></TABLE
></DD
><DT
><B
CLASS="COMMAND"
>last</B
></DT
><DD
><P
>List <I
CLASS="EMPHASIS"
>last</I
> logged in users, as read from
	      <TT
CLASS="FILENAME"
>/var/log/wtmp</TT
>. This command can also
	      show remote logins.</P
></DD
><DT
><B
CLASS="COMMAND"
>groups</B
></DT
><DD
><P
>Lists the current user and the groups she belongs to.
	       This corresponds to the <A
HREF="variables2.html#GROUPSREF"
>$GROUPS</A
> internal variable,
	       but gives the group names, rather than the numbers.</P
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="90%"
><TR
><TD
><PRE
CLASS="SCREEN"
> <TT
CLASS="PROMPT"
>bash$ </TT
><TT
CLASS="USERINPUT"
><B
>groups</B
></TT
>
 <TT
CLASS="COMPUTEROUTPUT"
>bozita cdrom cdwriter audio xgrp</TT
>
 
 <TT
CLASS="PROMPT"
>bash$ </TT
><TT
CLASS="USERINPUT"
><B
>echo $GROUPS</B
></TT
>
 <TT
CLASS="COMPUTEROUTPUT"
>501</TT
></PRE
></TD
></TR
></TABLE
></DD
><DT
><B
CLASS="COMMAND"
>newgrp</B
></DT
><DD
><P
>Change user's group ID without logging out. This permits
	      access to the new group's files. Since users may be
	      members of multiple groups simultaneously, this command
	      finds little use.</P
></DD
></DL
></DIV
><DIV
CLASS="VARIABLELIST"
><P
><B
><A
NAME="TERMINALSSYS1"
></A
>Terminals</B
></P
><DL
><DT
><B
CLASS="COMMAND"
>tty</B
></DT
><DD
><P
>Echoes the name of the current user's terminal.
	      Note that each separate xterm window counts as a different
	      terminal.</P
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="90%"
><TR
><TD
><PRE
CLASS="SCREEN"
> <TT
CLASS="PROMPT"
>bash$ </TT
><TT
CLASS="USERINPUT"
><B
>tty</B
></TT
>
 <TT
CLASS="COMPUTEROUTPUT"
>/dev/pts/1</TT
></PRE
></TD
></TR
></TABLE
></DD
><DT
><A
NAME="STTYREF"
></A
><B
CLASS="COMMAND"
>stty</B
></DT
><DD
><P
>Shows and/or changes terminal settings. This complex
	      command, used in a script, can control terminal behavior
	      and the way output displays. See the info page, and study
	      it carefully.</P
><DIV
CLASS="EXAMPLE"
><HR><A
NAME="ERASE"
></A
><P
><B
>Example 13-1. setting an erase character</B
></P
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="90%"
><TR
><TD
><PRE
CLASS="PROGRAMLISTING"
>   1&nbsp;#!/bin/bash
   2&nbsp;# erase.sh: Using "stty" to set an erase character when reading input.
   3&nbsp;
   4&nbsp;echo -n "What is your name? "
   5&nbsp;read name                      # Try to erase characters of input.
   6&nbsp;                               # Won't work.
   7&nbsp;echo "Your name is $name."
   8&nbsp;
   9&nbsp;stty erase '#'                 # Set "hashmark" (#) as erase character.
  10&nbsp;echo -n "What is your name? "
  11&nbsp;read name                      # Use # to erase last character typed.
  12&nbsp;echo "Your name is $name."
  13&nbsp;
  14&nbsp;exit 0</PRE
></TD
></TR
></TABLE
><HR></DIV
><DIV
CLASS="EXAMPLE"
><HR><A
NAME="SECRETPW"
></A
><P
><B
>Example 13-2. <B
CLASS="COMMAND"
>secret password</B
>:
	      Turning off terminal echoing </B
></P
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="90%"
><TR
><TD
><PRE
CLASS="PROGRAMLISTING"
>   1&nbsp;#!/bin/bash
   2&nbsp;
   3&nbsp;echo
   4&nbsp;echo -n "Enter password "
   5&nbsp;read passwd
   6&nbsp;echo "password is $passwd"
   7&nbsp;echo -n "If someone had been looking over your shoulder, "
   8&nbsp;echo "your password would have been compromised."
   9&nbsp;
  10&nbsp;echo &#38;&#38; echo  # Two line-feeds in an "and list".
  11&nbsp;
  12&nbsp;stty -echo    # Turns off screen echo.
  13&nbsp;
  14&nbsp;echo -n "Enter password again "
  15&nbsp;read passwd
  16&nbsp;echo
  17&nbsp;echo "password is $passwd"
  18&nbsp;echo
  19&nbsp;
  20&nbsp;stty echo     # Restores screen echo.
  21&nbsp;
  22&nbsp;exit 0</PRE
></TD
></TR
></TABLE
><HR></DIV
><P
>A creative use of <B
CLASS="COMMAND"
>stty</B
> is detecting a
	      user keypress (without hitting
	      <B
CLASS="KEYCAP"
>ENTER</B
>).</P
><DIV
CLASS="EXAMPLE"
><HR><A
NAME="KEYPRESS"
></A
><P
><B
>Example 13-3. Keypress detection</B
></P
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="90%"
><TR
><TD
><PRE
CLASS="PROGRAMLISTING"
>   1&nbsp;#!/bin/bash
   2&nbsp;# keypress.sh: Detect a user keypress ("hot keyboard").
   3&nbsp;
   4&nbsp;echo
   5&nbsp;
   6&nbsp;old_tty_settings=$(stty -g)   # Save old settings.
   7&nbsp;stty -icanon
   8&nbsp;Keypress=$(head -c1)          # or $(dd bs=1 count=1 2&#62; /dev/null)
   9&nbsp;                              # on non-GNU systems
  10&nbsp;
  11&nbsp;echo
  12&nbsp;echo "Key pressed was \""$Keypress"\"."
  13&nbsp;echo
  14&nbsp;
  15&nbsp;stty "$old_tty_settings"      # Restore old settings.
  16&nbsp;
  17&nbsp;# Thanks, Stephane Chazelas.
  18&nbsp;
  19&nbsp;exit 0</PRE
></TD
></TR
></TABLE
><HR></DIV
><P
>Also see <A
HREF="variables2.html#TIMEOUT"
>Example 9-3</A
>.</P
><TABLE
CLASS="SIDEBAR"
BORDER="1"
CELLPADDING="5"
><TR
><TD
><DIV
CLASS="SIDEBAR"
><A
NAME="AEN9072"
></A
><P
><B
>terminals and modes</B
></P
><P
>Normally, a terminal works in the
	      <I
CLASS="EMPHASIS"
>canonical</I
> mode.  When a user hits a
	      key, the resulting character does not immediately go to
	      the program actually running in this terminal.  A buffer
	      local to the terminal stores keystrokes. When the user
	      hits the <B
CLASS="KEYCAP"
>ENTER</B
> key, this sends all the
	      stored keystrokes to the program running.  There is even
	      a basic line editor inside the terminal.</P
><P
>	        <TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="90%"
><TR
><TD
><PRE
CLASS="SCREEN"
> <TT
CLASS="PROMPT"
>bash$ </TT
><TT
CLASS="USERINPUT"
><B
>stty -a</B
></TT
>
 <TT
CLASS="COMPUTEROUTPUT"
>speed 9600 baud; rows 36; columns 96; line = 0;
 intr = ^C; quit = ^\; erase = ^H; kill = ^U; eof = ^D; eol = &#60;undef&#62;; eol2 = &#60;undef&#62;;
 start = ^Q; stop = ^S; susp = ^Z; rprnt = ^R; werase = ^W; lnext = ^V; flush = ^O;
 ...
 isig icanon iexten echo echoe echok -echonl -noflsh -xcase -tostop -echoprt</TT
>
                 </PRE
></TD
></TR
></TABLE
>
	    </P
><P
>Using canonical mode, it is possible to redefine the
              special keys for the local terminal line editor.

	        <TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="90%"
><TR
><TD
><PRE
CLASS="SCREEN"
> <TT
CLASS="PROMPT"
>bash$ </TT
><TT
CLASS="USERINPUT"
><B
>cat &#62; filexxx</B
></TT
>
 <TT
CLASS="USERINPUT"
><B
>wha&#60;ctl-W&#62;I&#60;ctl-H&#62;foo bar&#60;ctl-U&#62;hello world&#60;ENTER&#62;</B
></TT
>
 <TT
CLASS="USERINPUT"
><B
>&#60;ctl-D&#62;</B
></TT
>
 <TT
CLASS="PROMPT"
>bash$ </TT
><TT
CLASS="USERINPUT"
><B
>cat filexxx</B
></TT
>
 <TT
CLASS="COMPUTEROUTPUT"
>hello world</TT
>		
 <TT
CLASS="PROMPT"
>bash$ </TT
><TT
CLASS="USERINPUT"
><B
>bash$ wc -c &#60; file</B
></TT
>
 <TT
CLASS="COMPUTEROUTPUT"
>13</TT
>		
                 </PRE
></TD
></TR
></TABLE
>

              The process controlling the terminal receives only 13
              characters (12 alphabetic ones, plus a newline), although
              the user hit 26 keys.
            </P
><P
>In non-canonical (<SPAN
CLASS="QUOTE"
>"raw"</SPAN
>) mode, every
              key hit (including special editing keys such as
              <B
CLASS="KEYCAP"
>ctl-H</B
>) sends a character immediately to
              the controlling process.</P
><P
>The Bash prompt disables both <TT
CLASS="OPTION"
>icanon</TT
>
              and <TT
CLASS="OPTION"
>echo</TT
>, since it replaces the basic
              terminal line editor with its own more elaborate one. For
              example, when you hit <B
CLASS="KEYCAP"
>ctl-A</B
> at the Bash
              prompt, there's no <B
CLASS="KEYCAP"
>^A</B
> echoed by the
              terminal, but Bash gets a <B
CLASS="KEYCAP"
>\1</B
> character,
              interprets it, and moves the cursor to the begining of
              the line.</P
><P
><I
CLASS="EMPHASIS"
>Stephane Chazelas</I
></P
></DIV
></TD
></TR
></TABLE
></DD
><DT
><B
CLASS="COMMAND"
>tset</B
></DT
><DD
><P
>Show or initialize terminal settings. 
	      This is a less capable version of
	      <B
CLASS="COMMAND"
>stty</B
>.</P
><P
>	      <TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="90%"
><TR
><TD
><PRE
CLASS="SCREEN"
> <TT
CLASS="PROMPT"
>bash$ </TT
><TT
CLASS="USERINPUT"
><B
>tset -r</B
></TT
>
 <TT
CLASS="COMPUTEROUTPUT"
>Terminal type is xterm-xfree86.
 Kill is control-U (^U).
 Interrupt is control-C (^C).</TT
>
 	      </PRE
></TD
></TR
></TABLE
>
	    </P
></DD
><DT
><B
CLASS="COMMAND"
>setserial</B
></DT
><DD
><P
>Set or display serial port parameters. This command must be
	      run by root user and is usually found in a system setup
	      script.</P
><P
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="90%"
><TR
><TD
><PRE
CLASS="PROGRAMLISTING"
>   1&nbsp;# From /etc/pcmcia/serial script:
   2&nbsp;
   3&nbsp;IRQ=`setserial /dev/$DEVICE | sed -e 's/.*IRQ: //'`
   4&nbsp;setserial /dev/$DEVICE irq 0 ; setserial /dev/$DEVICE irq $IRQ</PRE
></TD
></TR
></TABLE
></P
></DD
><DT
><B
CLASS="COMMAND"
>getty</B
>, <B
CLASS="COMMAND"
>agetty</B
></DT
><DD
><P
>The initialization process for a terminal uses
	      <B
CLASS="COMMAND"
>getty</B
> or <B
CLASS="COMMAND"
>agetty</B
>
	      to set it up for login by a user. These commands are not
	      used within user shell scripts. Their scripting counterpart
	      is <B
CLASS="COMMAND"
>stty</B
>.</P
></DD
><DT
><A
NAME="MESGREF"
></A
><B
CLASS="COMMAND"
>mesg</B
></DT
><DD
><P
>Enables or disables write access to the current user's
	      terminal.  Disabling access would prevent another user
	      on the network to <A
HREF="communications.html#WRITEREF"
>write</A
>
	      to the terminal.</P
><DIV
CLASS="TIP"
><TABLE
CLASS="TIP"
WIDTH="90%"
BORDER="0"
><TR
><TD
WIDTH="25"
ALIGN="CENTER"
VALIGN="TOP"
><IMG
SRC="common/tip.png"
HSPACE="5"
ALT="Tip"></TD
><TD
ALIGN="LEFT"
VALIGN="TOP"
><P
>It can be very annoying to have a message
	      about ordering pizza suddenly appear in the middle of
	      the text file you are editing. On a multi-user network,
	      you might therefore wish to disable write access to your
	      terminal when you need to avoid interruptions.</P
></TD
></TR
></TABLE
></DIV
></DD
><DT
><B
CLASS="COMMAND"
>wall</B
></DT
><DD
><P
>This is an acronym for <SPAN
CLASS="QUOTE"
>"<A
HREF="communications.html#WRITEREF"
>write</A
> all"</SPAN
>, i.e., sending
	      a message to all users at every terminal logged into the
	      network. It is primarily a system administrator's tool,
	      useful, for example, when warning everyone that the
	      system will shortly go down due to a problem (see <A
HREF="here-docs.html#EX70"
>Example 17-2</A
>).</P
><P
>	      <TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="90%"
><TR
><TD
><PRE
CLASS="SCREEN"
> <TT
CLASS="PROMPT"
>bash$ </TT
><TT
CLASS="USERINPUT"
><B
>wall System going down for maintenance in 5 minutes!</B
></TT
>
 <TT
CLASS="COMPUTEROUTPUT"
>Broadcast message from bozo (pts/1) Sun Jul  8 13:53:27 2001...

 System going down for maintenance in 5 minutes!</TT
>
 	      </PRE
></TD
></TR
></TABLE
>
	    </P
><DIV
CLASS="NOTE"
><TABLE
CLASS="NOTE"
WIDTH="90%"
BORDER="0"
><TR
><TD
WIDTH="25"
ALIGN="CENTER"
VALIGN="TOP"
><IMG
SRC="common/note.png"
HSPACE="5"
ALT="Note"></TD
><TD
ALIGN="LEFT"
VALIGN="TOP"
><P
>If write access to a particular terminal has been
	      disabled with <B
CLASS="COMMAND"
>mesg</B
>, then
	      <B
CLASS="COMMAND"
>wall</B
> cannot send a message to
	      it.</P
></TD
></TR
></TABLE
></DIV
></DD
><DT
><B
CLASS="COMMAND"
>dmesg</B
></DT
><DD
><P
>Lists all system bootup messages to
	      <TT
CLASS="FILENAME"
>stdout</TT
>. Handy for debugging and
	      ascertaining which device drivers were installed
	      and which system interrupts in use. The output
	      of <B
CLASS="COMMAND"
>dmesg</B
> may, of course, be
	      parsed with <A
HREF="textproc.html#GREPREF"
>grep</A
>,
	      <A
HREF="sedawk.html#SEDREF"
>sed</A
>, or <A
HREF="awk.html#AWKREF"
>awk</A
> from within a script.</P
></DD
></DL
></DIV
><DIV
CLASS="VARIABLELIST"
><P
><B
><A
NAME="STATISTICSSYS1"
></A
>Information and Statistics</B
></P
><DL
><DT
><B
CLASS="COMMAND"
>uname</B
></DT
><DD
><P
>Output system specifications (OS, kernel version,
	      etc.) to <TT
CLASS="FILENAME"
>stdout</TT
>.  Invoked with the
	      <TT
CLASS="OPTION"
>-a</TT
> option, gives verbose system info
	      (see <A
HREF="moreadv.html#EX41"
>Example 12-4</A
>). The <TT
CLASS="OPTION"
>-s</TT
>
	      option shows only the OS type.</P
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="90%"
><TR
><TD
><PRE
CLASS="SCREEN"
> <TT
CLASS="PROMPT"
>bash$ </TT
><TT
CLASS="USERINPUT"
><B
>uname -a</B
></TT
>
 <TT
CLASS="COMPUTEROUTPUT"
>Linux localhost.localdomain 2.2.15-2.5.0 #1 Sat Feb 5 00:13:43 EST 2000 i686 unknown</TT
>
 
 <TT
CLASS="PROMPT"
>bash$ </TT
><TT
CLASS="USERINPUT"
><B
>uname -s</B
></TT
>
 <TT
CLASS="COMPUTEROUTPUT"
>Linux</TT
></PRE
></TD
></TR
></TABLE
></DD
><DT
><B
CLASS="COMMAND"
>arch</B
></DT
><DD
><P
>Show system architecture.
	      Equivalent to <B
CLASS="COMMAND"
>uname -m</B
>. See <A
HREF="testbranch.html#CASECMD"
>Example 10-24</A
>.</P
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="90%"
><TR
><TD
><PRE
CLASS="SCREEN"
> <TT
CLASS="PROMPT"
>bash$ </TT
><TT
CLASS="USERINPUT"
><B
>arch</B
></TT
>
 <TT
CLASS="COMPUTEROUTPUT"
>i686</TT
>
 
 <TT
CLASS="PROMPT"
>bash$ </TT
><TT
CLASS="USERINPUT"
><B
>uname -m</B
></TT
>
 <TT
CLASS="COMPUTEROUTPUT"
>i686</TT
></PRE
></TD
></TR
></TABLE
></DD
><DT
><B
CLASS="COMMAND"
>lastcomm</B
></DT
><DD
><P
>Gives information about previous commands, as stored
	      in the <TT
CLASS="FILENAME"
>/var/account/pacct</TT
> file. Command
	      name and user name can be specified by options. This is
	      one of the GNU accounting utilities.</P
></DD
><DT
><B
CLASS="COMMAND"
>lastlog</B
></DT
><DD
><P
>List the last login time of all system users. This
	      references the <TT
CLASS="FILENAME"
>/var/log/lastlog</TT
>
	      file.</P
><P
>	      <TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="90%"
><TR
><TD
><PRE
CLASS="SCREEN"
> <TT
CLASS="PROMPT"
>bash$ </TT
><TT
CLASS="USERINPUT"
><B
>lastlog</B
></TT
>
 <TT
CLASS="COMPUTEROUTPUT"
>root          tty1                      Fri Dec  7 18:43:21 -0700 2001
 bin                                     **Never logged in**
 daemon                                  **Never logged in**
 ...
 bozo          tty1                      Sat Dec  8 21:14:29 -0700 2001</TT
>
 
 
 
 <TT
CLASS="PROMPT"
>bash$ </TT
><TT
CLASS="USERINPUT"
><B
>lastlog | grep root</B
></TT
>
 <TT
CLASS="COMPUTEROUTPUT"
>root          tty1                      Fri Dec  7 18:43:21 -0700 2001</TT
>
 	      </PRE
></TD
></TR
></TABLE
>
	      </P
><DIV
CLASS="CAUTION"
><TABLE
CLASS="CAUTION"
WIDTH="90%"
BORDER="0"
><TR
><TD
WIDTH="25"
ALIGN="CENTER"
VALIGN="TOP"
><IMG
SRC="common/caution.png"
HSPACE="5"
ALT="Caution"></TD
><TD
ALIGN="LEFT"
VALIGN="TOP"
><P
>This command will fail if the user invoking
		it does not have read permission for the
		<TT
CLASS="FILENAME"
>/var/log/lastlog</TT
> file.</P
></TD
></TR
></TABLE
></DIV
></DD
><DT
><B
CLASS="COMMAND"
>lsof</B
></DT
><DD
><P
>List open files. This command outputs a detailed
	      table of all currently open files and gives information
	      about their owner, size, the processes associated with
	      them, and more. Of course, <B
CLASS="COMMAND"
>lsof</B
> may
	      be piped to <A
HREF="textproc.html#GREPREF"
>grep</A
> and/or
	      <A
HREF="awk.html#AWKREF"
>awk</A
> to parse and analyze
	      its results.</P
><P
>	      <TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="90%"
><TR
><TD
><PRE
CLASS="SCREEN"
> <TT
CLASS="PROMPT"
>bash$ </TT
><TT
CLASS="USERINPUT"
><B
>lsof</B
></TT
>
 <TT
CLASS="COMPUTEROUTPUT"
>COMMAND    PID    USER   FD   TYPE     DEVICE    SIZE     NODE NAME
 init         1    root  mem    REG        3,5   30748    30303 /sbin/init
 init         1    root  mem    REG        3,5   73120     8069 /lib/ld-2.1.3.so
 init         1    root  mem    REG        3,5  931668     8075 /lib/libc-2.1.3.so
 cardmgr    213    root  mem    REG        3,5   36956    30357 /sbin/cardmgr
 ...</TT
>
 	      </PRE
></TD
></TR
></TABLE
>
	    </P
></DD
><DT
><B
CLASS="COMMAND"
>strace</B
></DT
><DD
><P
>Diagnostic and debugging tool for tracing system
	      calls and signals. The simplest way of invoking it is
	      <B
CLASS="COMMAND"
>strace COMMAND</B
>.</P
><P
>	    <TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="90%"
><TR
><TD
><PRE
CLASS="SCREEN"
> <TT
CLASS="PROMPT"
>bash$ </TT
><TT
CLASS="USERINPUT"
><B
>strace df</B
></TT
>
 <TT
CLASS="COMPUTEROUTPUT"
>execve("/bin/df", ["df"], [/* 45 vars */]) = 0
 uname({sys="Linux", node="bozo.localdomain", ...}) = 0
 brk(0)                                  = 0x804f5e4
 ...</TT
>
 	    </PRE
></TD
></TR
></TABLE
>
	    </P
><P
>This is the Linux equivalent of
	      <B
CLASS="COMMAND"
>truss</B
>.</P
></DD
><DT
><A
NAME="FREEREF"
></A
><B
CLASS="COMMAND"
>free</B
></DT
><DD
><P
>Shows memory and cache usage in tabular form. The
	      output of this command lends itself to parsing, using
	      <A
HREF="textproc.html#GREPREF"
>grep</A
>, <A
HREF="awk.html#AWKREF"
>awk</A
> or <B
CLASS="COMMAND"
>Perl</B
>. The
	      <B
CLASS="COMMAND"
>procinfo</B
> command shows all the
	      information that <B
CLASS="COMMAND"
>free</B
> does, and much
	      more.</P
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="90%"
><TR
><TD
><PRE
CLASS="SCREEN"
> <TT
CLASS="PROMPT"
>bash$ </TT
><B
CLASS="COMMAND"
>free</B
>
 <TT
CLASS="COMPUTEROUTPUT"
>                total       used       free     shared    buffers     cached
   Mem:         30504      28624       1880      15820       1608       16376
   -/+ buffers/cache:      10640      19864
   Swap:        68540       3128      65412</TT
></PRE
></TD
></TR
></TABLE
><P
>To show unused RAM memory:</P
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="90%"
><TR
><TD
><PRE
CLASS="SCREEN"
> <TT
CLASS="PROMPT"
>bash$ </TT
><B
CLASS="COMMAND"
>free | grep Mem | awk '{ print $4 }'</B
>
 <TT
CLASS="COMPUTEROUTPUT"
>1880</TT
></PRE
></TD
></TR
></TABLE
></DD
><DT
><A
NAME="PROCINFOREF"
></A
><B
CLASS="COMMAND"
>procinfo</B
></DT
><DD
><P
>Extract and list information and statistics from the
	      <A
HREF="devproc.html#DEVPROCREF"
><TT
CLASS="FILENAME"
>/proc</TT
>
	      pseudo-filesystem</A
>. This gives a very extensive and
	      detailed listing.</P
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="90%"
><TR
><TD
><PRE
CLASS="SCREEN"
> <TT
CLASS="PROMPT"
>bash$ </TT
><TT
CLASS="USERINPUT"
><B
>procinfo | grep Bootup</B
></TT
>
 <TT
CLASS="COMPUTEROUTPUT"
>Bootup: Wed Mar 21 15:15:50 2001    Load average: 0.04 0.21 0.34 3/47 6829</TT
></PRE
></TD
></TR
></TABLE
></DD
><DT
><A
NAME="LSDEVREF"
></A
><B
CLASS="COMMAND"
>lsdev</B
></DT
><DD
><P
>List devices, that is, show installed hardware.</P
><P
>	      <TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="90%"
><TR
><TD
><PRE
CLASS="SCREEN"
> <TT
CLASS="PROMPT"
>bash$ </TT
><TT
CLASS="USERINPUT"
><B
>lsdev</B
></TT
>
 <TT
CLASS="COMPUTEROUTPUT"
>Device            DMA   IRQ  I/O Ports
 ------------------------------------------------
 cascade             4     2 
 dma                          0080-008f
 dma1                         0000-001f
 dma2                         00c0-00df
 fpu                          00f0-00ff
 ide0                     14  01f0-01f7 03f6-03f6
 ...</TT
>
 	      </PRE
></TD
></TR
></TABLE
>
	      </P
></DD
><DT
><A
NAME="DUREF"
></A
><B
CLASS="COMMAND"
>du</B
></DT
><DD
><P
>Show (disk) file usage, recursively. Defaults to current
	      working directory, unless otherwise specified.</P
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="90%"
><TR
><TD
><PRE
CLASS="SCREEN"
> <TT
CLASS="PROMPT"
>bash$ </TT
><B
CLASS="COMMAND"
>du -ach</B
>
 <TT
CLASS="COMPUTEROUTPUT"
>1.0k    ./wi.sh
 1.0k    ./tst.sh
 1.0k    ./random.file
 6.0k    .
 6.0k    total</TT
></PRE
></TD
></TR
></TABLE
></DD
><DT
><A
NAME="DFREF"
></A
><B
CLASS="COMMAND"
>df</B
></DT
><DD
><P
>Shows filesystem usage in tabular form.</P
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="90%"
><TR
><TD
><PRE
CLASS="SCREEN"
> <TT
CLASS="PROMPT"
>bash$ </TT
><B
CLASS="COMMAND"
>df</B
>
 <TT
CLASS="COMPUTEROUTPUT"
>Filesystem           1k-blocks      Used Available Use% Mounted on
 /dev/hda5               273262     92607    166547  36% /
 /dev/hda8               222525    123951     87085  59% /home
 /dev/hda7              1408796   1075744    261488  80% /usr</TT
></PRE
></TD
></TR
></TABLE
></DD
><DT
><B
CLASS="COMMAND"
>stat</B
></DT
><DD
><P
>Gives detailed and verbose <I
CLASS="EMPHASIS"
>stat</I
>istics 
	      on a given file (even a directory or device file) or set
	      of files.</P
><P
>	      <TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="90%"
><TR
><TD
><PRE
CLASS="SCREEN"
> <TT
CLASS="PROMPT"
>bash$ </TT
><TT
CLASS="USERINPUT"
><B
>stat test.cru</B
></TT
>
 <TT
CLASS="COMPUTEROUTPUT"
>  File: "test.cru"
   Size: 49970        Allocated Blocks: 100          Filetype: Regular File
   Mode: (0664/-rw-rw-r--)         Uid: (  501/ bozo)  Gid: (  501/ bozo)
 Device:  3,8   Inode: 18185     Links: 1    
 Access: Sat Jun  2 16:40:24 2001
 Modify: Sat Jun  2 16:40:24 2001
 Change: Sat Jun  2 16:40:24 2001</TT
>
 	      </PRE
></TD
></TR
></TABLE
>
	    </P
><P
>If the target file does not exist, <B
CLASS="COMMAND"
>stat</B
>
	      returns an error message.</P
><P
>	      <TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="90%"
><TR
><TD
><PRE
CLASS="SCREEN"
> <TT
CLASS="PROMPT"
>bash$ </TT
><TT
CLASS="USERINPUT"
><B
>stat nonexistent-file</B
></TT
>
 <TT
CLASS="COMPUTEROUTPUT"
>nonexistent-file: No such file or directory</TT
>
 	      </PRE
></TD
></TR
></TABLE
>
	    </P
></DD
><DT
><A
NAME="VMSTATREF"
></A
><B
CLASS="COMMAND"
>vmstat</B
></DT
><DD
><P
>Display virtual memory statistics.</P
><P
>	    <TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="90%"
><TR
><TD
><PRE
CLASS="SCREEN"
> <TT
CLASS="PROMPT"
>bash$ </TT
><TT
CLASS="USERINPUT"
><B
>vmstat</B
></TT
>
 <TT
CLASS="COMPUTEROUTPUT"
>   procs                      memory    swap          io system         cpu
 r  b  w   swpd   free   buff  cache  si  so    bi    bo   in    cs  us  sy id
 0  0  0      0  11040   2636  38952   0   0    33     7  271    88   8   3 89</TT
>
 	    </PRE
></TD
></TR
></TABLE
>
	    </P
></DD
><DT
><B
CLASS="COMMAND"
>netstat</B
></DT
><DD
><P
>Show current network statistics and information, 
	      such as routing tables and active connections. This utility
	      accesses information in <TT
CLASS="FILENAME"
>/proc/net</TT
>
	      (<A
HREF="devproc.html"
>Chapter 28</A
>). See <A
HREF="procref1.html#CONSTAT"
>Example 28-2</A
>.</P
><P
><B
CLASS="COMMAND"
>netstat -r</B
> is equivalent to <A
HREF="system.html#ROUTEREF"
>route</A
>.</P
></DD
><DT
><A
NAME="UPTIMEREF"
></A
><B
CLASS="COMMAND"
>uptime</B
></DT
><DD
><P
>Shows how long the system has been running, along with
	      associated statistics.</P
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="90%"
><TR
><TD
><PRE
CLASS="SCREEN"
> <TT
CLASS="PROMPT"
>bash$ </TT
><TT
CLASS="USERINPUT"
><B
>uptime</B
></TT
>
 <TT
CLASS="COMPUTEROUTPUT"
>10:28pm  up  1:57,  3 users,  load average: 0.17, 0.34, 0.27</TT
></PRE
></TD
></TR
></TABLE
></DD
><DT
><A
NAME="HNAMEREF"
></A
><B
CLASS="COMMAND"
>hostname</B
></DT
><DD
><P
>Lists the system's host name. This command sets the host
	      name in an <TT
CLASS="FILENAME"
>/etc/rc.d</TT
>
	      setup script (<TT
CLASS="FILENAME"
>/etc/rc.d/rc.sysinit</TT
>
	      or similar).  It is equivalent to <B
CLASS="COMMAND"
>uname
	      -n</B
>,  and a counterpart to the <A
HREF="variables2.html#HOSTNAMEREF"
>$HOSTNAME</A
> internal
	      variable.</P
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="90%"
><TR
><TD
><PRE
CLASS="SCREEN"
> <TT
CLASS="PROMPT"
>bash$ </TT
><TT
CLASS="USERINPUT"
><B
>hostname</B
></TT
>
 <TT
CLASS="COMPUTEROUTPUT"
>localhost.localdomain</TT
>
 
 <TT
CLASS="PROMPT"
>bash$ </TT
><TT
CLASS="USERINPUT"
><B
>echo $HOSTNAME</B
></TT
>
 <TT
CLASS="COMPUTEROUTPUT"
>localhost.localdomain</TT
></PRE
></TD
></TR
></TABLE
></DD
><DT
><A
NAME="HOSTIDREF"
></A
><B
CLASS="COMMAND"
>hostid</B
></DT
><DD
><P
>Echo a 32-bit hexadecimal numerical identifier for the
	      host machine.</P
><P
>	      <TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="90%"
><TR
><TD
><PRE
CLASS="SCREEN"
> <TT
CLASS="PROMPT"
>bash$ </TT
><TT
CLASS="USERINPUT"
><B
>hostid</B
></TT
>
 <TT
CLASS="COMPUTEROUTPUT"
>7f0100</TT
></PRE
></TD
></TR
></TABLE
>
	    </P
><DIV
CLASS="NOTE"
><TABLE
CLASS="NOTE"
WIDTH="90%"
BORDER="0"
><TR
><TD
WIDTH="25"
ALIGN="CENTER"
VALIGN="TOP"
><IMG
SRC="common/note.png"
HSPACE="5"
ALT="Note"></TD
><TD
ALIGN="LEFT"
VALIGN="TOP"
><P
>This command allegedly fetches a <SPAN
CLASS="QUOTE"
>"unique"</SPAN
>
	      serial number for a particular system. Certain
	      product registration procedures use this number
	      to brand a particular user license. Unfortunately,
	      <B
CLASS="COMMAND"
>hostid</B
> only returns the machine
	      network address in hexadecimal, with pairs of bytes
	      transposed.</P
><P
>The network address of a typical non-networked Linux
	      machine, is found in <TT
CLASS="FILENAME"
>/etc/hosts</TT
>.</P
><P
>	      <TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="90%"
><TR
><TD
><PRE
CLASS="SCREEN"
> <TT
CLASS="PROMPT"
>bash$ </TT
><TT
CLASS="USERINPUT"
><B
>cat /etc/hosts</B
></TT
>
 <TT
CLASS="COMPUTEROUTPUT"
>127.0.0.1               localhost.localdomain localhost</TT
></PRE
></TD
></TR
></TABLE
>
	    </P
><P
>As it happens, transposing the bytes of
	      <TT
CLASS="USERINPUT"
><B
>127.0.0.1</B
></TT
>, we get
	      <TT
CLASS="USERINPUT"
><B
>0.127.1.0</B
></TT
>, which translates in
	      hex to <TT
CLASS="USERINPUT"
><B
>007f0100</B
></TT
>, the exact equivalent
	      of what <B
CLASS="COMMAND"
>hostid</B
> returns, above. There
	      exist only a few million other Linux machines with this
	      identical <I
CLASS="EMPHASIS"
>hostid</I
>.</P
></TD
></TR
></TABLE
></DIV
></DD
><DT
><B
CLASS="COMMAND"
>sar</B
></DT
><DD
><P
>Invoking <B
CLASS="COMMAND"
>sar</B
> (system activity report)
	      gives a very detailed rundown on system statistics.
	      This command is found on some commercial UNIX
	      systems, but is not part of the base Linux
	      distribution.  It is contained in the <A
HREF="http://perso.wanadoo.fr/sebastien.godard/"
TARGET="_top"
>	      sysstat utilities</A
> package, written by <A
HREF="mailto:sebastien.godard@wanadoo.fr"
TARGET="_top"
>Sebastien
	      Godard</A
>.</P
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="90%"
><TR
><TD
><PRE
CLASS="SCREEN"
> <TT
CLASS="PROMPT"
>bash$ </TT
><TT
CLASS="USERINPUT"
><B
>sar</B
></TT
>
 <TT
CLASS="COMPUTEROUTPUT"
>Linux 2.4.7-10 (localhost.localdomain) 	12/31/2001

 10:30:01 AM       CPU     %user     %nice   %system     %idle
 10:40:00 AM       all      1.39      0.00      0.77     97.84
 10:50:00 AM       all     76.83      0.00      1.45     21.72
 11:00:00 AM       all      1.32      0.00      0.69     97.99
 11:10:00 AM       all      1.17      0.00      0.30     98.53
 11:20:00 AM       all      0.51      0.00      0.30     99.19
 06:30:00 PM       all    100.00      0.00    100.01      0.00
 Average:          all      1.39      0.00      0.66     97.95</TT
>
            </PRE
></TD
></TR
></TABLE
></DD
></DL
></DIV
><DIV
CLASS="VARIABLELIST"
><P
><B
><A
NAME="SYSLOG1"
></A
>System Logs</B
></P
><DL
><DT
><B
CLASS="COMMAND"
>logger</B
></DT
><DD
><P
>Appends a user-generated message to the system log
	      (<TT
CLASS="FILENAME"
>/var/log/messages</TT
>). You do not have
	      to be root to invoke <B
CLASS="COMMAND"
>logger</B
>.
	      <TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="90%"
><TR
><TD
><PRE
CLASS="PROGRAMLISTING"
>   1&nbsp;logger Experiencing instability in network connection at 23:10, 05/21.
   2&nbsp;# Now, do a 'tail /var/log/messages'.</PRE
></TD
></TR
></TABLE
></P
><P
>By embedding a <B
CLASS="COMMAND"
>logger</B
> command in a script,
	      it is possible to write debugging information to
	      <TT
CLASS="FILENAME"
>/var/log/messages</TT
>.
                 <TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="90%"
><TR
><TD
><PRE
CLASS="PROGRAMLISTING"
>   1&nbsp;logger -t $0 -i Logging at line "$LINENO".
   2&nbsp;# The "-t" option specifies the tag for the logger entry.
   3&nbsp;# The "-i" option records the process ID.
   4&nbsp;
   5&nbsp;# tail /var/log/message
   6&nbsp;# ...
   7&nbsp;# Jul  7 20:48:58 localhost ./test.sh[1712]: Logging at line 3.</PRE
></TD
></TR
></TABLE
>
            </P
></DD
><DT
><B
CLASS="COMMAND"
>logrotate</B
></DT
><DD
><P
>This utility manages the system log files, rotating,
	      compressing, deleting, and/or mailing them, as appropriate.
	      Usually <A
HREF="system.html#CRONREF"
>crond</A
> runs
	      <B
CLASS="COMMAND"
>logrotate</B
> on a daily basis.</P
><P
>Adding an appropriate entry to
	       <TT
CLASS="FILENAME"
>/etc/logrotate.conf</TT
> makes it possible
	       to manage personal log files, as well as system-wide
	       ones.</P
></DD
></DL
></DIV
><DIV
CLASS="VARIABLELIST"
><P
><B
><A
NAME="JOBCONTROLSYS1"
></A
>Job Control</B
></P
><DL
><DT
><B
CLASS="COMMAND"
>ps</B
></DT
><DD
><P
><TT
CLASS="REPLACEABLE"
><I
>P</I
></TT
>rocess
	      <TT
CLASS="REPLACEABLE"
><I
>S</I
></TT
>tatistics: lists currently
	      executing processes by owner and PID (process id). This
	      is usually invoked with <TT
CLASS="OPTION"
>ax</TT
> options,
	      and may be piped to <A
HREF="textproc.html#GREPREF"
>grep</A
>
	      or <A
HREF="sedawk.html#SEDREF"
>sed</A
> to search for a
	      specific process (see <A
HREF="internal.html#EX44"
>Example 11-8</A
> and <A
HREF="procref1.html#PIDID"
>Example 28-1</A
>).</P
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="90%"
><TR
><TD
><PRE
CLASS="SCREEN"
> <TT
CLASS="PROMPT"
>bash$ </TT
><TT
CLASS="USERINPUT"
><B
> ps ax | grep sendmail</B
></TT
>
 <TT
CLASS="COMPUTEROUTPUT"
>295 ?	   S	  0:00 sendmail: accepting connections on port 25</TT
></PRE
></TD
></TR
></TABLE
></DD
><DT
><B
CLASS="COMMAND"
>pstree</B
></DT
><DD
><P
>Lists currently executing processes in
	      <SPAN
CLASS="QUOTE"
>"tree"</SPAN
> format. The <TT
CLASS="OPTION"
>-p</TT
> option
	      shows the PIDs, as well as the process names.</P
></DD
><DT
><B
CLASS="COMMAND"
>top</B
></DT
><DD
><P
>Continuously updated display of most cpu-intensive
	      processes. The <TT
CLASS="OPTION"
>-b</TT
> option displays in text
	      mode, so that the output may be parsed or accessed from
	      a script.</P
><P
>	      <TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="90%"
><TR
><TD
><PRE
CLASS="SCREEN"
> <TT
CLASS="PROMPT"
>bash$ </TT
><TT
CLASS="USERINPUT"
><B
>top -b</B
></TT
>
 <TT
CLASS="COMPUTEROUTPUT"
>  8:30pm  up 3 min,  3 users,  load average: 0.49, 0.32, 0.13
 45 processes: 44 sleeping, 1 running, 0 zombie, 0 stopped
 CPU states: 13.6% user,  7.3% system,  0.0% nice, 78.9% idle
 Mem:    78396K av,   65468K used,   12928K free,       0K shrd,    2352K buff
 Swap:  157208K av,       0K used,  157208K free                   37244K cached

   PID USER     PRI  NI  SIZE  RSS SHARE STAT %CPU %MEM   TIME COMMAND
   848 bozo      17   0   996  996   800 R     5.6  1.2   0:00 top
     1 root       8   0   512  512   444 S     0.0  0.6   0:04 init
     2 root       9   0     0    0     0 SW    0.0  0.0   0:00 keventd
   ...</TT
>  
 	      </PRE
></TD
></TR
></TABLE
>
	    </P
></DD
><DT
><B
CLASS="COMMAND"
>nice</B
></DT
><DD
><P
>Run a background job with an altered
	      priority. Priorities run from 19 (lowest) to -20
	      (highest). Only <I
CLASS="EMPHASIS"
>root</I
> may set the
	      negative (higher) priorities. Related commands are
	      <B
CLASS="COMMAND"
>renice</B
>, <B
CLASS="COMMAND"
>snice</B
>,
	      and <B
CLASS="COMMAND"
>skill</B
>.</P
></DD
><DT
><B
CLASS="COMMAND"
>nohup</B
></DT
><DD
><P
>Keeps a command running even after user logs off.
	      The command will run as a foreground process unless followed
	      by <SPAN
CLASS="TOKEN"
>&#38;</SPAN
>.  If you use <B
CLASS="COMMAND"
>nohup</B
>
	      within a script, consider coupling it with a <A
HREF="internal.html#WAITREF"
>wait</A
> to avoid creating an orphan
	      or zombie process.</P
></DD
><DT
><A
NAME="PIDOFREF"
></A
><B
CLASS="COMMAND"
>pidof</B
></DT
><DD
><P
>Identifies <I
CLASS="EMPHASIS"
>process id (pid)</I
> of a
	    running job. Since job control commands, such as <A
HREF="internal.html#KILLREF"
>kill</A
> and <B
CLASS="COMMAND"
>renice</B
>
	    act on the <I
CLASS="EMPHASIS"
>pid</I
> of a process (not
	    its name), it is sometimes necessary to identify that
	    <I
CLASS="EMPHASIS"
>pid</I
>.  The <B
CLASS="COMMAND"
>pidof</B
>
	    command is the approximate counterpart to the <A
HREF="variables2.html#PPIDREF"
>$PPID</A
> internal variable.</P
><P
>	      <TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="90%"
><TR
><TD
><PRE
CLASS="SCREEN"
> <TT
CLASS="PROMPT"
>bash$ </TT
><TT
CLASS="USERINPUT"
><B
>pidof xclock</B
></TT
>
 <TT
CLASS="COMPUTEROUTPUT"
>880</TT
>
 	      </PRE
></TD
></TR
></TABLE
>
	    </P
><DIV
CLASS="EXAMPLE"
><HR><A
NAME="KILLPROCESS"
></A
><P
><B
>Example 13-4. <B
CLASS="COMMAND"
>pidof</B
> helps kill a process</B
></P
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="90%"
><TR
><TD
><PRE
CLASS="PROGRAMLISTING"
>   1&nbsp;#!/bin/bash
   2&nbsp;# kill-process.sh
   3&nbsp;
   4&nbsp;NOPROCESS=2
   5&nbsp;
   6&nbsp;process=xxxyyyzzz  # Use nonexistent process.
   7&nbsp;# For demo purposes only...
   8&nbsp;# ... don't want to actually kill any actual process with this script.
   9&nbsp;#
  10&nbsp;# If, for example, you wanted to use this script to logoff the Internet,
  11&nbsp;#     process=pppd
  12&nbsp;
  13&nbsp;t=`pidof $process`       # Find pid (process id) of $process.
  14&nbsp;# The pid is needed by 'kill' (can't 'kill' by program name).
  15&nbsp;
  16&nbsp;if [ -z "$t" ]           # If process not present, 'pidof' returns null.
  17&nbsp;then
  18&nbsp;  echo "Process $process was not running."
  19&nbsp;  echo "Nothing killed."
  20&nbsp;  exit $NOPROCESS
  21&nbsp;fi  
  22&nbsp;
  23&nbsp;kill $t                  # May need 'kill -9' for stubborn process.
  24&nbsp;
  25&nbsp;# Need a check here to see if process allowed itself to be killed.
  26&nbsp;# Perhaps another " t=`pidof $process` ".
  27&nbsp;
  28&nbsp;
  29&nbsp;# This entire script could be replaced by
  30&nbsp;#    kill $(pidof -x process_name)
  31&nbsp;# but it would not be as instructive.
  32&nbsp;
  33&nbsp;exit 0</PRE
></TD
></TR
></TABLE
><HR></DIV
></DD
><DT
><B
CLASS="COMMAND"
>fuser</B
></DT
><DD
><P
>Identifies the processes (by pid) that are accessing
	      a given file, set of files, or directory. May also be
	      invoked with the <TT
CLASS="OPTION"
>-k</TT
> option, which kills
	      those processes. This has interesting implications for
	      system security, especially in scripts preventing
	      unauthorized users from accessing system services.</P
></DD
><DT
><A
NAME="CRONREF"
></A
><B
CLASS="COMMAND"
>crond</B
></DT
><DD
><P
>Administrative program scheduler, performing such
	      duties as cleaning up and deleting system log
	      files and updating the <SPAN
CLASS="DATABASE"
>slocate</SPAN
>
	      database. This is the superuser version of <A
HREF="timedate.html#ATREF"
>at</A
> (although each user may have their
	      own <TT
CLASS="FILENAME"
>crontab</TT
> file which can be changed
	      with the <B
CLASS="COMMAND"
>crontab</B
> command).  It runs
	      as a <A
HREF="communications.html#DAEMONREF"
>daemon</A
> and executes
	      scheduled entries from <TT
CLASS="FILENAME"
>/etc/crontab</TT
>.</P
></DD
></DL
></DIV
><DIV
CLASS="VARIABLELIST"
><P
><B
><A
NAME="RUNCONTROLSYS1"
></A
>Process Control and Booting</B
></P
><DL
><DT
><B
CLASS="COMMAND"
>init</B
></DT
><DD
><P
>The <B
CLASS="COMMAND"
>init</B
> command is the <A
HREF="internal.html#FORKREF"
>parent</A
> of all processes. Called
	      in the final step of a bootup, <B
CLASS="COMMAND"
>init</B
>
	      determines the runlevel of the system from
	      <TT
CLASS="FILENAME"
>/etc/inittab</TT
>. Invoked by its alias
	      <B
CLASS="COMMAND"
>telinit</B
>, and by root only.</P
></DD
><DT
><B
CLASS="COMMAND"
>telinit</B
></DT
><DD
><P
>Symlinked to <B
CLASS="COMMAND"
>init</B
>, this is a means of changing the system runlevel,
	      usually done for system maintenance or emergency filesystem
	      repairs. Invoked only by root. This command can be dangerous - be
	      certain you understand it well before using!</P
></DD
><DT
><B
CLASS="COMMAND"
>runlevel</B
></DT
><DD
><P
>Shows the current and last runlevel, that is, whether the system
	      is halted (runlevel <TT
CLASS="LITERAL"
>0</TT
>), in single-user mode
	      (<TT
CLASS="LITERAL"
>1</TT
>), in multi-user mode (<TT
CLASS="LITERAL"
>2</TT
>
	      or <TT
CLASS="LITERAL"
>3</TT
>), in X Windows (<TT
CLASS="LITERAL"
>5</TT
>), or
	      rebooting (<TT
CLASS="LITERAL"
>6</TT
>). This command accesses the
	      <TT
CLASS="FILENAME"
>/var/run/utmp</TT
> file.</P
></DD
><DT
><B
CLASS="COMMAND"
>halt</B
>, <B
CLASS="COMMAND"
>shutdown</B
>, <B
CLASS="COMMAND"
>reboot</B
></DT
><DD
><P
>Command set to shut the system down, usually just prior to a power down.</P
></DD
></DL
></DIV
><DIV
CLASS="VARIABLELIST"
><P
><B
><A
NAME="NETWORKSYS1"
></A
>Network</B
></P
><DL
><DT
><B
CLASS="COMMAND"
>ifconfig</B
></DT
><DD
><P
>Network interface configuration  and tuning utility.
	      It is most often used at bootup to set up the interfaces,
	      or to shut them down when rebooting.
	        <TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="90%"
><TR
><TD
><PRE
CLASS="PROGRAMLISTING"
>   1&nbsp;# Code snippets from /etc/rc.d/init.d/network
   2&nbsp;
   3&nbsp;# ...
   4&nbsp;
   5&nbsp;# Check that networking is up.
   6&nbsp;[ ${NETWORKING} = "no" ] &#38;&#38; exit 0
   7&nbsp;
   8&nbsp;[ -x /sbin/ifconfig ] || exit 0
   9&nbsp;
  10&nbsp;# ...
  11&nbsp;
  12&nbsp;for i in $interfaces ; do
  13&nbsp;  if ifconfig $i 2&#62;/dev/null | grep -q "UP" &#62;/dev/null 2&#62;&#38;1 ; then
  14&nbsp;    action "Shutting down interface $i: " ./ifdown $i boot
  15&nbsp;  fi
  16&nbsp;# The GNU-specific "-q" option to to "grep" means "quiet", i.e., producing no output.
  17&nbsp;# Redirecting output to /dev/null is therefore not strictly necessary.
  18&nbsp;       
  19&nbsp;# ...
  20&nbsp;
  21&nbsp;echo "Currently active devices:"
  22&nbsp;echo `/sbin/ifconfig | grep ^[a-z] | awk '{print $1}'`
  23&nbsp;#                            ^^^^^  should be quoted to prevent globbing.
  24&nbsp;#  The following also work.
  25&nbsp;#    echo $(/sbin/ifconfig | awk '/^[a-z]/ { print $1 })'
  26&nbsp;#    echo $(/sbin/ifconfig | sed -e 's/ .*//')
  27&nbsp;#  Thanks, S.C., for additional comments.</PRE
></TD
></TR
></TABLE
>

	    See also <A
HREF="debugging.html#ONLINE"
>Example 30-5</A
>.</P
></DD
><DT
><A
NAME="ROUTEREF"
></A
><B
CLASS="COMMAND"
>route</B
></DT
><DD
><P
>Show info about or make changes to the kernel routing table.</P
><P
>	      <TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="90%"
><TR
><TD
><PRE
CLASS="SCREEN"
> <TT
CLASS="PROMPT"
>bash$ </TT
><TT
CLASS="USERINPUT"
><B
>route</B
></TT
>
 <TT
CLASS="COMPUTEROUTPUT"
>Destination     Gateway         Genmask         Flags   MSS Window  irtt Iface
 pm3-67.bozosisp *               255.255.255.255 UH       40 0          0 ppp0
 127.0.0.0       *               255.0.0.0       U        40 0          0 lo
 default         pm3-67.bozosisp 0.0.0.0         UG       40 0          0 ppp0</TT
>
 	      </PRE
></TD
></TR
></TABLE
>
	    </P
></DD
><DT
><B
CLASS="COMMAND"
>chkconfig</B
></DT
><DD
><P
>Check network configuration. This command lists and
	      manages the network services started at bootup in the
	      <TT
CLASS="FILENAME"
>/etc/rc?.d</TT
>
	      directory.</P
><P
>Originally a port from IRIX to Red Hat Linux,
	      <B
CLASS="COMMAND"
>chkconfig</B
> may not be part of the core
	      installation of some Linux flavors.</P
><P
>	      <TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="90%"
><TR
><TD
><PRE
CLASS="SCREEN"
> <TT
CLASS="PROMPT"
>bash$ </TT
><TT
CLASS="USERINPUT"
><B
>chkconfig --list</B
></TT
>
 <TT
CLASS="COMPUTEROUTPUT"
>atd             0:off   1:off   2:off   3:on    4:on    5:on    6:off
 rwhod           0:off   1:off   2:off   3:off   4:off   5:off   6:off
 ...</TT
>
 	      </PRE
></TD
></TR
></TABLE
>
	    </P
></DD
><DT
><B
CLASS="COMMAND"
>tcpdump</B
></DT
><DD
><P
>Network packet <SPAN
CLASS="QUOTE"
>"sniffer"</SPAN
>. This is a tool for
	      analyzing and troubleshooting traffic on a network by dumping
	      packet headers that match specified criteria.</P
><P
>Dump ip packet traffic between hosts
	        <I
CLASS="EMPHASIS"
>bozoville</I
> and
	        <I
CLASS="EMPHASIS"
>caduceus</I
>:
	      <TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="90%"
><TR
><TD
><PRE
CLASS="SCREEN"
> <TT
CLASS="PROMPT"
>bash$ </TT
><TT
CLASS="USERINPUT"
><B
>tcpdump ip host bozoville and caduceus</B
></TT
>
 	      </PRE
></TD
></TR
></TABLE
>
	      </P
><P
>Of course, the output of <B
CLASS="COMMAND"
>tcpdump</B
> can be
	        parsed, using certain of the previously discussed <A
HREF="textproc.html#TPCOMMANDLISTING1"
>text processing
		utilities</A
>.</P
></DD
></DL
></DIV
><DIV
CLASS="VARIABLELIST"
><P
><B
><A
NAME="FILESYSTEMSYS1"
></A
>Filesystem</B
></P
><DL
><DT
><B
CLASS="COMMAND"
>mount</B
></DT
><DD
><P
>Mount a filesystem, usually on an external device,
	      such as a floppy or CDROM. The file
	      <TT
CLASS="FILENAME"
>/etc/fstab</TT
> provides a handy listing
	      of available filesystems, partitions, and devices,
	      including options, that may be automatically or manually
	      mounted. The file <TT
CLASS="FILENAME"
>/etc/mtab</TT
> shows
	      the currently mounted filesystems and partitions
	      (including the virtual ones, such as <TT
CLASS="FILENAME"
>/proc</TT
>).</P
><P
><B
CLASS="COMMAND"
>mount -a</B
> mounts all filesystems and
	      partitions listed in <TT
CLASS="FILENAME"
>/etc/fstab</TT
>,
	      except those with a <TT
CLASS="OPTION"
>noauto</TT
>
	      option. At bootup, a startup script in
	      <TT
CLASS="FILENAME"
>/etc/rc.d</TT
>
	      (<TT
CLASS="FILENAME"
>rc.sysinit</TT
> or something similar)
	      invokes this to get everything mounted.</P
><P
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="90%"
><TR
><TD
><PRE
CLASS="PROGRAMLISTING"
>   1&nbsp;mount -t iso9660 /dev/cdrom /mnt/cdrom
   2&nbsp;# Mounts CDROM
   3&nbsp;mount /mnt/cdrom
   4&nbsp;# Shortcut, if /mnt/cdrom listed in /etc/fstab</PRE
></TD
></TR
></TABLE
>
     </P
><P
>This versatile command can even mount an ordinary file
       on a block device, and the file will act as if it were a
       filesystem.  <B
CLASS="COMMAND"
>Mount</B
> accomplishes that by
       associating the file with a <A
HREF="devproc.html#LOOPBACKREF"
>loopback
       device</A
>. One application of this is to mount and examine
       an ISO9660 image before burning it onto a CDR.
       
	  <A
NAME="AEN9880"
HREF="#FTN.AEN9880"
>[3]</A
>

       </P
><DIV
CLASS="EXAMPLE"
><HR><A
NAME="ISOMOUNTREF"
></A
><P
><B
>Example 13-5. Checking a CD image</B
></P
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="90%"
><TR
><TD
><PRE
CLASS="PROGRAMLISTING"
>   1&nbsp;# As root...
   2&nbsp;
   3&nbsp;mkdir /mnt/cdtest  # Prepare a mount point, if not already there.
   4&nbsp;
   5&nbsp;mount -r -t iso9660 -o loop cd-image.iso /mnt/cdtest   # Mount the image.
   6&nbsp;#                  "-o loop" option equivalent to "losetup /dev/loop0"
   7&nbsp;cd /mnt/cdtest     # Now, check the image.
   8&nbsp;ls -alR            # List the files in the directory tree there.
   9&nbsp;                   # And so forth.</PRE
></TD
></TR
></TABLE
><HR></DIV
></DD
><DT
><B
CLASS="COMMAND"
>umount</B
></DT
><DD
><P
>Unmount a currently mounted filesystem. Before physically removing a
	      previously mounted floppy or CDROM disk, the device must be
	      <B
CLASS="COMMAND"
>umount</B
>ed, else filesystem corruption may result.
	      <TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="90%"
><TR
><TD
><PRE
CLASS="PROGRAMLISTING"
>   1&nbsp;umount /mnt/cdrom
   2&nbsp;# You may now press the eject button and safely remove the disk.</PRE
></TD
></TR
></TABLE
></P
><DIV
CLASS="NOTE"
><TABLE
CLASS="NOTE"
WIDTH="90%"
BORDER="0"
><TR
><TD
WIDTH="25"
ALIGN="CENTER"
VALIGN="TOP"
><IMG
SRC="common/note.png"
HSPACE="5"
ALT="Note"></TD
><TD
ALIGN="LEFT"
VALIGN="TOP"
><P
>The <B
CLASS="COMMAND"
>automount</B
> utility, if
		properly installed, can mount and unmount floppies or
		CDROM disks as they are accessed or removed. On laptops
		with swappable floppy and CDROM drives, this can cause
		problems, though.</P
></TD
></TR
></TABLE
></DIV
></DD
><DT
><B
CLASS="COMMAND"
>sync</B
></DT
><DD
><P
>Forces an immediate write of all updated data from
	      buffers to hard drive (synchronize drive
	      with buffers). While not strictly necessary, a
	      <B
CLASS="COMMAND"
>sync</B
> assures the sys admin or
	      user that the data just changed will survive a sudden
	      power failure. In the olden days, a <TT
CLASS="USERINPUT"
><B
>sync;
	      sync</B
></TT
> (twice, just to make absolutely sure) was a
	      useful precautionary measure before a system reboot.</P
><P
>At times, you may wish to force an immediate buffer
	      flush, as when securely deleting a file (see <A
HREF="extmisc.html#BLOTOUT"
>Example 12-36</A
>) or when the lights begin to
	      flicker.</P
></DD
><DT
><A
NAME="LOSETUPREF"
></A
><B
CLASS="COMMAND"
>losetup</B
></DT
><DD
><P
>Sets up and configures <A
HREF="devproc.html#LOOPBACKREF"
>	      loopback devices</A
>.</P
><DIV
CLASS="EXAMPLE"
><HR><A
NAME="CREATEFS"
></A
><P
><B
>Example 13-6. Creating a filesystem in a file</B
></P
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="90%"
><TR
><TD
><PRE
CLASS="PROGRAMLISTING"
>   1&nbsp;SIZE=1000000  # 1 meg
   2&nbsp;
   3&nbsp;head -c $SIZE &#60; /dev/zero &#62; file  # Set up file of designated size.
   4&nbsp;losetup /dev/loop0 file           # Set it up as loopback device.
   5&nbsp;mke2fs /dev/loop0                 # Create filesystem.
   6&nbsp;mount -o loop /dev/loop0 /mnt     # Mount it.
   7&nbsp;
   8&nbsp;# Thanks, S.C.</PRE
></TD
></TR
></TABLE
><HR></DIV
></DD
><DT
><B
CLASS="COMMAND"
>mkswap</B
></DT
><DD
><P
>Creates a swap partition or file. The swap area must
	      subsequently be enabled with
	      <B
CLASS="COMMAND"
>swapon</B
>.</P
></DD
><DT
><B
CLASS="COMMAND"
>swapon</B
>, <B
CLASS="COMMAND"
>swapoff</B
></DT
><DD
><P
>Enable / disable swap partitition or file.
	      These commands usually take effect at bootup and
	      shutdown.</P
></DD
><DT
><A
NAME="MKE2FSREF"
></A
><B
CLASS="COMMAND"
>mke2fs</B
></DT
><DD
><P
>Create a Linux ext2 filesystem. This command must
	      be invoked as root.</P
><DIV
CLASS="EXAMPLE"
><HR><A
NAME="ADDDRV"
></A
><P
><B
>Example 13-7. Adding a new hard drive</B
></P
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="90%"
><TR
><TD
><PRE
CLASS="PROGRAMLISTING"
>   1&nbsp;#!/bin/bash
   2&nbsp;
   3&nbsp;# Adding a second hard drive to system.
   4&nbsp;# Software configuration. Assumes hardware already mounted.
   5&nbsp;# From an article by the author of this document.
   6&nbsp;# in issue #38 of "Linux Gazette", http://www.linuxgazette.com.
   7&nbsp;
   8&nbsp;ROOT_UID=0     # This script must be run as root.
   9&nbsp;E_NOTROOT=67   # Non-root exit error.
  10&nbsp;
  11&nbsp;if [ "$UID" -ne "$ROOT_UID" ]
  12&nbsp;then
  13&nbsp;  echo "Must be root to run this script."
  14&nbsp;  exit $E_NOTROOT
  15&nbsp;fi  
  16&nbsp;
  17&nbsp;# Use with extreme caution!
  18&nbsp;# If something goes wrong, you may wipe out your current filesystem.
  19&nbsp;
  20&nbsp;
  21&nbsp;NEWDISK=/dev/hdb         # Assumes /dev/hdb vacant. Check!
  22&nbsp;MOUNTPOINT=/mnt/newdisk  # Or choose another mount point.
  23&nbsp;
  24&nbsp;
  25&nbsp;fdisk $NEWDISK
  26&nbsp;mke2fs -cv $NEWDISK1   # Check for bad blocks &#38; verbose output.
  27&nbsp;#  Note:    /dev/hdb1, *not* /dev/hdb!
  28&nbsp;mkdir $MOUNTPOINT
  29&nbsp;chmod 777 $MOUNTPOINT  # Makes new drive accessible to all users.
  30&nbsp;
  31&nbsp;
  32&nbsp;# Now, test...
  33&nbsp;# mount -t ext2 /dev/hdb1 /mnt/newdisk
  34&nbsp;# Try creating a directory.
  35&nbsp;# If it works, umount it, and proceed.
  36&nbsp;
  37&nbsp;# Final step:
  38&nbsp;# Add the following line to /etc/fstab.
  39&nbsp;# /dev/hdb1  /mnt/newdisk  ext2  defaults  1 1
  40&nbsp;
  41&nbsp;exit 0</PRE
></TD
></TR
></TABLE
><HR></DIV
><P
>See also <A
HREF="system.html#CREATEFS"
>Example 13-6</A
> and <A
HREF="zeros.html#RAMDISK"
>Example 29-3</A
>.</P
></DD
><DT
><B
CLASS="COMMAND"
>tune2fs</B
></DT
><DD
><P
>Tune ext2 filesystem. May be used to change filesystem
	      parameters, such as maximum mount count. This must be
	      invoked as root.</P
><DIV
CLASS="WARNING"
><TABLE
CLASS="WARNING"
WIDTH="90%"
BORDER="0"
><TR
><TD
WIDTH="25"
ALIGN="CENTER"
VALIGN="TOP"
><IMG
SRC="common/warning.png"
HSPACE="5"
ALT="Warning"></TD
><TD
ALIGN="LEFT"
VALIGN="TOP"
><P
>This is an extremely dangerous command. Use it at
	      your own risk, as you may inadvertently destroy your filesystem.
	      </P
></TD
></TR
></TABLE
></DIV
></DD
><DT
><B
CLASS="COMMAND"
>dumpe2fs</B
></DT
><DD
><P
>Dump (list to <TT
CLASS="FILENAME"
>stdout</TT
>) very verbose
	      filesystem info. This must be invoked as root.</P
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="90%"
><TR
><TD
><PRE
CLASS="SCREEN"
> <TT
CLASS="PROMPT"
>root# </TT
><B
CLASS="COMMAND"
>dumpe2fs /dev/hda7 | grep 'ount count'</B
>
 <TT
CLASS="COMPUTEROUTPUT"
>dumpe2fs 1.19, 13-Jul-2000 for EXT2 FS 0.5b, 95/08/09
 Mount count:              6
 Maximum mount count:      20</TT
></PRE
></TD
></TR
></TABLE
></DD
><DT
><B
CLASS="COMMAND"
>hdparm</B
></DT
><DD
><P
>List or change hard disk parameters. This command must be
	      invoked as root, and it may be dangerous if misused.</P
></DD
><DT
><A
NAME="FDISKREF"
></A
><B
CLASS="COMMAND"
>fdisk</B
></DT
><DD
><P
>Create or change a partition table on a storage device,
	      usually a hard drive. This command must be invoked as
	      root.</P
><DIV
CLASS="WARNING"
><TABLE
CLASS="WARNING"
WIDTH="90%"
BORDER="0"
><TR
><TD
WIDTH="25"
ALIGN="CENTER"
VALIGN="TOP"
><IMG
SRC="common/warning.png"
HSPACE="5"
ALT="Warning"></TD
><TD
ALIGN="LEFT"
VALIGN="TOP"
><P
>Use this command with extreme caution. If something
	      goes wrong, you may destroy an existing
	      filesystem.</P
></TD
></TR
></TABLE
></DIV
></DD
><DT
><A
NAME="FSCKREF"
></A
><B
CLASS="COMMAND"
>fsck</B
>, <B
CLASS="COMMAND"
>e2fsck</B
>, <B
CLASS="COMMAND"
>debugfs</B
></DT
><DD
><P
>Filesystem check, repair, and debug command set.</P
><P
><B
CLASS="COMMAND"
>fsck</B
>: a front end for checking a UNIX
	      filesystem (may invoke other utilities). The actual
	      filesystem type generally defaults to ext2.</P
><P
><B
CLASS="COMMAND"
>e2fsck</B
>: ext2 filesystem checker.</P
><P
><B
CLASS="COMMAND"
>debugfs</B
>: ext2 filesystem debugger.</P
><DIV
CLASS="CAUTION"
><TABLE
CLASS="CAUTION"
WIDTH="90%"
BORDER="0"
><TR
><TD
WIDTH="25"
ALIGN="CENTER"
VALIGN="TOP"
><IMG
SRC="common/caution.png"
HSPACE="5"
ALT="Caution"></TD
><TD
ALIGN="LEFT"
VALIGN="TOP"
><P
>All of these should be invoked as root, and they
	      can damage or destroy a filesystem if misused.</P
></TD
></TR
></TABLE
></DIV
></DD
><DT
><B
CLASS="COMMAND"
>badblocks</B
></DT
><DD
><P
>Checks for bad blocks (physical media flaws) on a
	      storage device.  This command finds use when formatting
	      a newly installed hard drive or testing the integrity
	      of backup media.
	        <A
NAME="AEN10069"
HREF="#FTN.AEN10069"
>[4]</A
>
	      As an example, <B
CLASS="COMMAND"
>badblocks /dev/fd0</B
>
	      tests a floppy disk.</P
><P
>The <B
CLASS="COMMAND"
>badblocks</B
> command
	      may be invoked destructively (overwrite all data) or in
	      non-destructive read-only mode. If root user owns the
	      device to be tested, as is generally the case, then root
	      must invoke this command.</P
></DD
><DT
><B
CLASS="COMMAND"
>mkbootdisk</B
></DT
><DD
><P
>Creates a boot floppy which can be used to bring up the
	      system if, for example, the MBR (master boot record) becomes
	      corrupted. The <B
CLASS="COMMAND"
>mkbootdisk</B
> command is actually
	      a Bash script, written by Erik Troan, in the <TT
CLASS="FILENAME"
>/sbin</TT
> directory.</P
></DD
><DT
><B
CLASS="COMMAND"
>chroot</B
></DT
><DD
><P
>CHange ROOT directory. Normally commands are fetched
	      from <A
HREF="variables2.html#PATHREF"
>$PATH</A
>, relative to
	      <TT
CLASS="FILENAME"
>/</TT
>, the default root
	      directory. This changes the root directory to a different
	      one (and also changes the working directory to there).
	      This is useful for security purposes, for instance when
	      the system administrator wishes to restrict certain users,
	      such as those <A
HREF="communications.html#TELNETREF"
>telnetting</A
>
	      in, to a secured portion of the filesystem (this
	      is sometimes referred to as confining a guest user
	      to a <SPAN
CLASS="QUOTE"
>"chroot jail"</SPAN
>). Note that after a
	      <B
CLASS="COMMAND"
>chroot</B
>, the execution path for system
	      binaries is no longer valid.</P
><P
>A <TT
CLASS="USERINPUT"
><B
>chroot /opt</B
></TT
> would cause
		references to <TT
CLASS="FILENAME"
>/usr/bin</TT
>
		to be translated to <TT
CLASS="FILENAME"
>/opt/usr/bin</TT
>. Likewise,
		<TT
CLASS="USERINPUT"
><B
>chroot /aaa/bbb /bin/ls</B
></TT
> would
		redirect future instances of <B
CLASS="COMMAND"
>ls</B
>
		to <TT
CLASS="FILENAME"
>/aaa/bbb</TT
> as the base directory,
		rather than <TT
CLASS="FILENAME"
>/</TT
> as is
		normally the case. An <B
CLASS="COMMAND"
>alias XX 'chroot /aaa/bbb
		ls'</B
> in a user's <TT
CLASS="FILENAME"
>~/.bashrc</TT
>
		effectively restricts which portion of the filesystem
		she may run command <SPAN
CLASS="QUOTE"
>"XX"</SPAN
> on.</P
><P
>The <B
CLASS="COMMAND"
>chroot</B
> command is also handy
	      when running from an emergency boot floppy 
	      (<B
CLASS="COMMAND"
>chroot</B
> to <TT
CLASS="FILENAME"
>/dev/fd0</TT
>),
	      or as an option to <B
CLASS="COMMAND"
>lilo</B
> when recovering
	      from a system crash. Other uses include installation
	      from a different filesystem (an <B
CLASS="COMMAND"
>rpm</B
>
	      option) or running a readonly filesystem from a CD ROM.
	      Invoke only as root, and use with care.</P
><DIV
CLASS="CAUTION"
><TABLE
CLASS="CAUTION"
WIDTH="90%"
BORDER="0"
><TR
><TD
WIDTH="25"
ALIGN="CENTER"
VALIGN="TOP"
><IMG
SRC="common/caution.png"
HSPACE="5"
ALT="Caution"></TD
><TD
ALIGN="LEFT"
VALIGN="TOP"
><P
>It might be necessary to copy certain system
	      files to a <I
CLASS="EMPHASIS"
>chrooted</I
> directory,
	      since the normal <TT
CLASS="VARNAME"
>$PATH</TT
> can no longer
	      be relied upon.</P
></TD
></TR
></TABLE
></DIV
></DD
><DT
><B
CLASS="COMMAND"
>lockfile</B
></DT
><DD
><P
>This utility is part of the <B
CLASS="COMMAND"
>procmail</B
>
	      package (<A
HREF="http://www.procmail.org"
TARGET="_top"
>www.procmail.org</A
>).
	      It creates a <I
CLASS="EMPHASIS"
>lock file</I
>, a semaphore file that
	      controls access to a file, device, or resource. The lock file
	      serves as a flag that this particular file, device, or resource is
	      in use by a particular process (<SPAN
CLASS="QUOTE"
>"busy"</SPAN
>), and
	      this permits only restricted access (or no access) to other
	      processes.</P
><P
>Lock files are used in such applications as protecting 
	      system mail folders from simultaneously being changed by multiple
	      users, indicating that a modem port is being accessed, and showing
	      that an instance of <SPAN
CLASS="APPLICATION"
>Netscape</SPAN
> is using its
	      cache.  Scripts may check for the existence of a lock file created
	      by a certain process to check if that process is running.  Note
	      that if a script attempts create a lock file that already exists,
	      the script will likely hang.</P
><P
>Normally, applications create and check for lock files
	      in the <TT
CLASS="FILENAME"
>/var/lock</TT
>
	      directory. A script can test for the presence of a lock file by
	      something like the following.
	        <TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="90%"
><TR
><TD
><PRE
CLASS="PROGRAMLISTING"
>   1&nbsp;appname=xyzip
   2&nbsp;# Application "xyzip" created lock file "/var/lock/xyzip.lock".
   3&nbsp;
   4&nbsp;if [ -e "/var/lock/$appname.lock ]
   5&nbsp;then
   6&nbsp;  ...</PRE
></TD
></TR
></TABLE
></P
></DD
><DT
><B
CLASS="COMMAND"
>mknod</B
></DT
><DD
><P
>Creates block or character device files (may be necessary when installing
	      new hardware on the system).</P
></DD
><DT
><B
CLASS="COMMAND"
>tmpwatch</B
></DT
><DD
><P
>Automatically deletes files which have not been accessed
	      within a specified period of time. Usually invoked by
	      <A
HREF="system.html#CRONREF"
>crond</A
> to remove stale log
	      files.</P
></DD
><DT
><B
CLASS="COMMAND"
>MAKEDEV</B
></DT
><DD
><P
>Utility for creating device files. It must be run as root,
	      and in the <TT
CLASS="FILENAME"
>/dev</TT
>
	      directory.

	    <TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="90%"
><TR
><TD
><PRE
CLASS="SCREEN"
> <TT
CLASS="PROMPT"
>root# </TT
><B
CLASS="COMMAND"
>./MAKEDEV</B
></PRE
></TD
></TR
></TABLE
>

	      This is a sort of advanced version of
	      <B
CLASS="COMMAND"
>mknod</B
>.</P
></DD
></DL
></DIV
><DIV
CLASS="VARIABLELIST"
><P
><B
><A
NAME="PERIPHSYS1"
></A
>Backup</B
></P
><DL
><DT
><B
CLASS="COMMAND"
>dump</B
>, <B
CLASS="COMMAND"
>restore</B
></DT
><DD
><P
>The <B
CLASS="COMMAND"
>dump</B
> command is an elaborate
	      filesystem backup utility, generally used on larger
	      installations and networks.
		<A
NAME="AEN10204"
HREF="#FTN.AEN10204"
>[5]</A
>
	      It reads raw disk partitions and writes a backup file
	      in a binary format.  Files to be backed up may be saved
	      to a variety of storage media, including disks and tape
	      drives. The <B
CLASS="COMMAND"
>restore</B
> command restores
	      backups made with <B
CLASS="COMMAND"
>dump</B
>.</P
></DD
><DT
><B
CLASS="COMMAND"
>fdformat</B
></DT
><DD
><P
>Perform a low-level format on a floppy disk.</P
></DD
></DL
></DIV
><DIV
CLASS="VARIABLELIST"
><P
><B
><A
NAME="SYSRESOURCES1"
></A
>System Resources</B
></P
><DL
><DT
><B
CLASS="COMMAND"
>ulimit</B
></DT
><DD
><P
>Sets an <I
CLASS="EMPHASIS"
>upper limit</I
> on system
	     resources. Usually invoked with the <TT
CLASS="OPTION"
>-f</TT
>
	     option, which sets a limit on file size (<B
CLASS="COMMAND"
>ulimit
	     -f 1000</B
> limits files to 1 meg maximum). The
	     <TT
CLASS="OPTION"
>-t</TT
> option limits the coredump size
	     (<B
CLASS="COMMAND"
>ulimit -c 0</B
> eliminates coredumps).
	      Normally, the value of <B
CLASS="COMMAND"
>ulimit</B
>
	      would be set in <TT
CLASS="FILENAME"
>/etc/profile</TT
>
	      and/or <TT
CLASS="FILENAME"
>~/.bash_profile</TT
> (see <A
HREF="files.html"
>Chapter 27</A
>).</P
></DD
><DT
><B
CLASS="COMMAND"
>umask</B
></DT
><DD
><P
>User file creation MASK. Limit the default file attributes
	      for a particular user.  All files created by that user take
	      on the attributes specified by <B
CLASS="COMMAND"
>umask</B
>. The
	      (octal) value passed to <B
CLASS="COMMAND"
>umask</B
> defines the
	      the file permissions <I
CLASS="EMPHASIS"
>disabled</I
>. For
	      example, <B
CLASS="COMMAND"
>umask 022</B
> ensures that
	      new files will have at most 755 permissions (777 NAND 022).

                <A
NAME="AEN10255"
HREF="#FTN.AEN10255"
>[6]</A
>
	      
	      Of course, the user may later change the
	      attributes of particular files with <A
HREF="external.html#CHMODREF"
>chmod</A
>.The usual practice
	      is to set the value of <B
CLASS="COMMAND"
>umask</B
>
	      in <TT
CLASS="FILENAME"
>/etc/profile</TT
> and/or
	      <TT
CLASS="FILENAME"
>~/.bash_profile</TT
> (see <A
HREF="files.html"
>Chapter 27</A
>).</P
></DD
><DT
><B
CLASS="COMMAND"
>rdev</B
></DT
><DD
><P
>Get info about or make changes to root device, swap space, or video
	       mode.  The functionality of <B
CLASS="COMMAND"
>rdev</B
> has generally been taken over by
	       <B
CLASS="COMMAND"
>lilo</B
>, but <B
CLASS="COMMAND"
>rdev</B
> remains
	       useful for setting up a ram disk. This is another dangerous command, if misused.
	     </P
></DD
></DL
></DIV
><DIV
CLASS="VARIABLELIST"
><P
><B
><A
NAME="MODULESSYS1"
></A
>Modules</B
></P
><DL
><DT
><B
CLASS="COMMAND"
>lsmod</B
></DT
><DD
><P
>List installed kernel modules.</P
><P
>	      <TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="90%"
><TR
><TD
><PRE
CLASS="SCREEN"
> <TT
CLASS="PROMPT"
>bash$ </TT
><TT
CLASS="USERINPUT"
><B
>lsmod</B
></TT
>
 <TT
CLASS="COMPUTEROUTPUT"
>Module                  Size  Used by
 autofs                  9456   2 (autoclean)
 opl3                   11376   0
 serial_cs               5456   0 (unused)
 sb                     34752   0
 uart401                 6384   0 [sb]
 sound                  58368   0 [opl3 sb uart401]
 soundlow                 464   0 [sound]
 soundcore               2800   6 [sb sound]
 ds                      6448   2 [serial_cs]
 i82365                 22928   2
 pcmcia_core            45984   0 [serial_cs ds i82365]</TT
>
 	      </PRE
></TD
></TR
></TABLE
>
	    </P
></DD
><DT
><B
CLASS="COMMAND"
>insmod</B
></DT
><DD
><P
>Force installation of a kernel module. Must be invoked
	      as root.</P
></DD
><DT
><B
CLASS="COMMAND"
>rmmod</B
></DT
><DD
><P
>Force unloading of a kernel module. Must be invoked
	      as root.</P
></DD
><DT
><B
CLASS="COMMAND"
>modprobe</B
></DT
><DD
><P
>Module loader that is normally invoked automatically in a startup script.</P
></DD
><DT
><B
CLASS="COMMAND"
>depmod</B
></DT
><DD
><P
>Creates module dependency file, usually invoked from startup script.</P
></DD
></DL
></DIV
><DIV
CLASS="VARIABLELIST"
><P
><B
><A
NAME="MISCSYS1"
></A
>Miscellaneous</B
></P
><DL
><DT
><B
CLASS="COMMAND"
>env</B
></DT
><DD
><P
>Runs a program or script with certain environmental
	      variables set or changed (without changing the overall
	      system environment). The <TT
CLASS="OPTION"
>[varname=xxx]</TT
>
	      permits changing the environmental variable
	      <TT
CLASS="VARNAME"
>varname</TT
> for the duration of the
	      script. With no options specified, this command lists all
	      the environmental variable settings.</P
><DIV
CLASS="NOTE"
><TABLE
CLASS="NOTE"
WIDTH="90%"
BORDER="0"
><TR
><TD
WIDTH="25"
ALIGN="CENTER"
VALIGN="TOP"
><IMG
SRC="common/note.png"
HSPACE="5"
ALT="Note"></TD
><TD
ALIGN="LEFT"
VALIGN="TOP"
><P
>In Bash and other Bourne shell derivatives, it is
	      possible to set variables in a single command's environment.
	      <TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="90%"
><TR
><TD
><PRE
CLASS="PROGRAMLISTING"
>   1&nbsp;var1=value1 var2=value2 commandXXX
   2&nbsp;# $var1 and $var2 set in the environment of 'commandXXX' only.</PRE
></TD
></TR
></TABLE
>	      
            </P
></TD
></TR
></TABLE
></DIV
><DIV
CLASS="TIP"
><TABLE
CLASS="TIP"
WIDTH="90%"
BORDER="0"
><TR
><TD
WIDTH="25"
ALIGN="CENTER"
VALIGN="TOP"
><IMG
SRC="common/tip.png"
HSPACE="5"
ALT="Tip"></TD
><TD
ALIGN="LEFT"
VALIGN="TOP"
><P
>The first line of a script (the
	      <SPAN
CLASS="QUOTE"
>"sha-bang"</SPAN
> line) may use <B
CLASS="COMMAND"
>env</B
>
	      when the path to the shell or interpreter is unknown.
	      <TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="90%"
><TR
><TD
><PRE
CLASS="PROGRAMLISTING"
>   1&nbsp;#! /usr/bin/env perl
   2&nbsp;
   3&nbsp;print "This Perl script will run,\n";
   4&nbsp;print "even when I don't know where to find Perl.\n";
   5&nbsp;
   6&nbsp;# Good for portable cross-platform scripts,
   7&nbsp;# where the Perl binaries may not be in the expected place.
   8&nbsp;# Thanks, S.C.</PRE
></TD
></TR
></TABLE
>
            </P
></TD
></TR
></TABLE
></DIV
></DD
><DT
><B
CLASS="COMMAND"
>ldd</B
></DT
><DD
><P
>Show shared lib dependencies for an executable file.</P
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="90%"
><TR
><TD
><PRE
CLASS="SCREEN"
> <TT
CLASS="PROMPT"
>bash$ </TT
><TT
CLASS="USERINPUT"
><B
>ldd /bin/ls</B
></TT
>
 <TT
CLASS="COMPUTEROUTPUT"
>libc.so.6 =&#62; /lib/libc.so.6 (0x4000c000)
/lib/ld-linux.so.2 =&#62; /lib/ld-linux.so.2 (0x80000000)</TT
></PRE
></TD
></TR
></TABLE
></DD
><DT
><B
CLASS="COMMAND"
>strip</B
></DT
><DD
><P
>Remove the debugging symbolic references from an executable
	      binary. This decreases its size, but makes debugging of it
	      impossible.</P
><P
>This command often occurs in a <A
HREF="filearchiv.html#MAKEFILEREF"
>Makefile</A
>,
	      but rarely in a shell script.</P
></DD
><DT
><B
CLASS="COMMAND"
>nm</B
></DT
><DD
><P
>List symbols in an unstripped compiled binary.</P
></DD
><DT
><B
CLASS="COMMAND"
>rdist</B
></DT
><DD
><P
>Remote distribution client: synchronizes, clones,
	      or backs up a file system on a remote server.</P
></DD
></DL
></DIV
><P
>Using our knowledge of administrative commands, let us examine a system
	script. One of the shortest and simplest to understand scripts is
	<B
CLASS="COMMAND"
>killall</B
>, used to suspend running processes at system shutdown.</P
><DIV
CLASS="EXAMPLE"
><HR><A
NAME="EX55"
></A
><P
><B
>Example 13-8. <B
CLASS="COMMAND"
>killall</B
>, from <TT
CLASS="FILENAME"
>/etc/rc.d/init.d</TT
></B
></P
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><PRE
CLASS="PROGRAMLISTING"
>   1&nbsp;#!/bin/sh
   2&nbsp;
   3&nbsp;# --&#62; Comments added by the author of this document marked by "# --&#62;".
   4&nbsp;
   5&nbsp;# --&#62; This is part of the 'rc' script package
   6&nbsp;# --&#62; by Miquel van Smoorenburg, &#60;miquels@drinkel.nl.mugnet.org&#62;
   7&nbsp;
   8&nbsp;# --&#62; This particular script seems to be Red Hat specific
   9&nbsp;# --&#62; (may not be present in other distributions).
  10&nbsp;
  11&nbsp;# Bring down all unneeded services that are still running (there shouldn't 
  12&nbsp;# be any, so this is just a sanity check)
  13&nbsp;
  14&nbsp;for i in /var/lock/subsys/*; do
  15&nbsp;        # --&#62; Standard for/in loop, but since "do" is on same line,
  16&nbsp;        # --&#62; it is necessary to add ";".
  17&nbsp;	# Check if the script is there.
  18&nbsp;	[ ! -f $i ] &#38;&#38; continue
  19&nbsp;	# --&#62; This is a clever use of an "and list", equivalent to:
  20&nbsp;	# --&#62; if [ ! -f "$i" ]; then continue
  21&nbsp;
  22&nbsp;	# Get the subsystem name.
  23&nbsp;	subsys=${i#/var/lock/subsys/}
  24&nbsp;	# --&#62; Match variable name, which, in this case, is the file name.
  25&nbsp;	# --&#62; This is the exact equivalent of subsys=`basename $i`.
  26&nbsp;	
  27&nbsp;	# --&#62; It gets it from the lock file name, and since if there
  28&nbsp;	# --&#62; is a lock file, that's proof the process has been running.
  29&nbsp;	# --&#62; See the "lockfile" entry, above.
  30&nbsp;
  31&nbsp;
  32&nbsp;	# Bring the subsystem down.
  33&nbsp;	if [ -f /etc/rc.d/init.d/$subsys.init ]; then
  34&nbsp;	    /etc/rc.d/init.d/$subsys.init stop
  35&nbsp;	else
  36&nbsp;	    /etc/rc.d/init.d/$subsys stop
  37&nbsp;	# --&#62; Suspend running jobs and daemons
  38&nbsp;        # --&#62; using the 'stop' shell builtin.
  39&nbsp;	fi
  40&nbsp;done</PRE
></TD
></TR
></TABLE
><HR></DIV
><P
>That wasn't so bad. Aside from a little fancy footwork with variable
	matching, there is no new material there.</P
><DIV
CLASS="FORMALPARA"
><P
><B
>Exercise 1. </B
>In <TT
CLASS="FILENAME"
>/etc/rc.d/init.d</TT
>,
	  analyze the <B
CLASS="COMMAND"
>halt</B
> script. It is a bit longer
	  than <B
CLASS="COMMAND"
>killall</B
>, but similar in concept. Make
	  a copy of this script somewhere in your home directory and
	  experiment with it (do <I
CLASS="EMPHASIS"
>not</I
> run it as
	  root). Do a simulated run with the <TT
CLASS="OPTION"
>-vn</TT
> flags
	  (<TT
CLASS="USERINPUT"
><B
>sh -vn scriptname</B
></TT
>). Add extensive
	  comments. Change the <SPAN
CLASS="QUOTE"
>"action"</SPAN
> commands to
	  <SPAN
CLASS="QUOTE"
>"echos"</SPAN
>.</P
></DIV
><DIV
CLASS="FORMALPARA"
><P
><B
>Exercise 2. </B
>Look at some of the more complex scripts in
	<TT
CLASS="FILENAME"
>/etc/rc.d/init.d</TT
>. See if
	you can understand parts of them. Follow the above procedure
	to analyze them. For some additional insight, you might also
	examine the file <TT
CLASS="FILENAME"
>sysvinitfiles</TT
> in <TT
CLASS="FILENAME"
>/usr/share/doc/initscripts-?.??</TT
>,
	which is part of the <SPAN
CLASS="QUOTE"
>"initscripts"</SPAN
>
	documentation.</P
></DIV
></DIV
><H3
CLASS="FOOTNOTES"
>Notes</H3
><TABLE
BORDER="0"
CLASS="FOOTNOTES"
WIDTH="100%"
><TR
><TD
ALIGN="LEFT"
VALIGN="TOP"
WIDTH="5%"
><A
NAME="FTN.AEN8800"
HREF="system.html#AEN8800"
>[1]</A
></TD
><TD
ALIGN="LEFT"
VALIGN="TOP"
WIDTH="95%"
><P
>This is the case on a Linux machine or a UNIX
		   system with disk quotas.</P
></TD
></TR
><TR
><TD
ALIGN="LEFT"
VALIGN="TOP"
WIDTH="5%"
><A
NAME="FTN.AEN8831"
HREF="system.html#AEN8831"
>[2]</A
></TD
><TD
ALIGN="LEFT"
VALIGN="TOP"
WIDTH="95%"
><P
>The <B
CLASS="COMMAND"
>userdel</B
> command
		   will fail if the particular user being deleted is
		   still logged on.</P
></TD
></TR
><TR
><TD
ALIGN="LEFT"
VALIGN="TOP"
WIDTH="5%"
><A
NAME="FTN.AEN9880"
HREF="system.html#AEN9880"
>[3]</A
></TD
><TD
ALIGN="LEFT"
VALIGN="TOP"
WIDTH="95%"
><P
>For more detail on burning CDRs, see Alex
	    Withers' article, <A
HREF="http://www2.linuxjournal.com/lj-issues/issue66/3335.html"
TARGET="_top"
>Creating
	    CDs</A
>, in the October, 1999 issue of <A
HREF="http://www.linuxjournal.com"
TARGET="_top"
>Linux
	     Journal</A
>.</P
></TD
></TR
><TR
><TD
ALIGN="LEFT"
VALIGN="TOP"
WIDTH="5%"
><A
NAME="FTN.AEN10069"
HREF="system.html#AEN10069"
>[4]</A
></TD
><TD
ALIGN="LEFT"
VALIGN="TOP"
WIDTH="95%"
><P
>The <TT
CLASS="OPTION"
>-c</TT
> option to <A
HREF="system.html#MKE2FSREF"
>mke2fs</A
> also invokes a check for bad
		blocks.</P
></TD
></TR
><TR
><TD
ALIGN="LEFT"
VALIGN="TOP"
WIDTH="5%"
><A
NAME="FTN.AEN10204"
HREF="system.html#AEN10204"
>[5]</A
></TD
><TD
ALIGN="LEFT"
VALIGN="TOP"
WIDTH="95%"
><P
>Operators of single-user Linux systems
		  generally prefer something simpler for backups, such
		  as <B
CLASS="COMMAND"
>tar</B
>.</P
></TD
></TR
><TR
><TD
ALIGN="LEFT"
VALIGN="TOP"
WIDTH="5%"
><A
NAME="FTN.AEN10255"
HREF="system.html#AEN10255"
>[6]</A
></TD
><TD
ALIGN="LEFT"
VALIGN="TOP"
WIDTH="95%"
><P
>NAND is the logical <SPAN
CLASS="QUOTE"
>"not-and"</SPAN
>
		  operator. Its effect is somewhat similar to
		  subtraction.</P
></TD
></TR
></TABLE
><DIV
CLASS="NAVFOOTER"
><HR
ALIGN="LEFT"
WIDTH="100%"><TABLE
WIDTH="100%"
BORDER="0"
CELLPADDING="0"
CELLSPACING="0"
><TR
><TD
WIDTH="33%"
ALIGN="left"
VALIGN="top"
><A
HREF="extmisc.html"
>Prev</A
></TD
><TD
WIDTH="34%"
ALIGN="center"
VALIGN="top"
><A
HREF="index.html"
>Home</A
></TD
><TD
WIDTH="33%"
ALIGN="right"
VALIGN="top"
><A
HREF="commandsub.html"
>Next</A
></TD
></TR
><TR
><TD
WIDTH="33%"
ALIGN="left"
VALIGN="top"
>Miscellaneous Commands</TD
><TD
WIDTH="34%"
ALIGN="center"
VALIGN="top"
><A
HREF="part3.html"
>Up</A
></TD
><TD
WIDTH="33%"
ALIGN="right"
VALIGN="top"
>Command Substitution</TD
></TR
></TABLE
></DIV
></BODY
></HTML
>