<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML
><HEAD
><TITLE
>Typing variables: declare or
	  typeset</TITLE
><META
NAME="GENERATOR"
CONTENT="Modular DocBook HTML Stylesheet Version 1.64
"><LINK
REL="HOME"
TITLE="Advanced Bash-Scripting Guide"
HREF="index.html"><LINK
REL="UP"
TITLE="Variables Revisited"
HREF="variables2.html"><LINK
REL="PREVIOUS"
TITLE="Parameter Substitution"
HREF="parameter-substitution.html"><LINK
REL="NEXT"
TITLE="Indirect References to Variables"
HREF="ivr.html"><META
HTTP-EQUIV="Content-Style-Type"
CONTENT="text/css"><LINK
REL="stylesheet"
HREF="common/kde-common.css"
TYPE="text/css"><META
HTTP-EQUIV="Content-Type"
CONTENT="text/html; charset=iso-8859-1"><META
HTTP-EQUIV="Content-Language"
CONTENT="en"><LINK
REL="stylesheet"
HREF="common/kde-localised.css"
TYPE="text/css"
TITLE="KDE-English"><LINK
REL="stylesheet"
HREF="common/kde-default.css"
TYPE="text/css"
TITLE="KDE-Default"></HEAD
><BODY
CLASS="SECT1"
BGCOLOR="#FFFFFF"
TEXT="#000000"
LINK="#AA0000"
VLINK="#AA0055"
ALINK="#AA0000"
STYLE="font-family: sans-serif;"
><DIV
CLASS="NAVHEADER"
><TABLE
WIDTH="100%"
BORDER="0"
CELLPADDING="0"
CELLSPACING="0"
><TR
><TH
COLSPAN="3"
ALIGN="center"
>Advanced Bash-Scripting Guide: An in-depth exploration of the art of shell scripting</TH
></TR
><TR
><TD
WIDTH="10%"
ALIGN="left"
VALIGN="bottom"
><A
HREF="parameter-substitution.html"
>Prev</A
></TD
><TD
WIDTH="80%"
ALIGN="center"
VALIGN="bottom"
>Chapter 9. Variables Revisited</TD
><TD
WIDTH="10%"
ALIGN="right"
VALIGN="bottom"
><A
HREF="ivr.html"
>Next</A
></TD
></TR
></TABLE
><HR
ALIGN="LEFT"
WIDTH="100%"></DIV
><DIV
CLASS="SECT1"
><H1
CLASS="SECT1"
><A
NAME="DECLAREREF"
>9.4. Typing variables: <B
CLASS="COMMAND"
>declare</B
> or
	  <B
CLASS="COMMAND"
>typeset</B
></A
></H1
><P
>The <B
CLASS="COMMAND"
>declare</B
> or <B
CLASS="COMMAND"
>typeset</B
>
	  <A
HREF="internal.html#BUILTINREF"
>builtins</A
> (they are exact
	  synonyms) permit restricting the properties of variables. This
	  is a very weak form of the typing available in certain
	  programming languages. The <B
CLASS="COMMAND"
>declare</B
>
	  command is specific to version 2 or later of Bash. The
	  <B
CLASS="COMMAND"
>typeset</B
> command also works in ksh
	  scripts.</P
><DIV
CLASS="VARIABLELIST"
><P
><B
><A
NAME="DECLAREOPSREF1"
></A
>declare/typeset options</B
></P
><DL
><DT
><SPAN
CLASS="TOKEN"
>-r</SPAN
> <TT
CLASS="REPLACEABLE"
><I
>readonly</I
></TT
></DT
><DD
><P
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="90%"
><TR
><TD
><PRE
CLASS="PROGRAMLISTING"
>   1&nbsp;declare -r var1</PRE
></TD
></TR
></TABLE
></P
><P
>(<TT
CLASS="USERINPUT"
><B
>declare -r var1</B
></TT
> works the same as
		<TT
CLASS="USERINPUT"
><B
>readonly var1</B
></TT
>)</P
><P
>This is the rough equivalent of the C
		<B
CLASS="COMMAND"
>const</B
> type qualifier. An 
		attempt to change the value of a readonly variable fails with an 
		error message.</P
></DD
><DT
><SPAN
CLASS="TOKEN"
>-i</SPAN
> <TT
CLASS="REPLACEABLE"
><I
>integer</I
></TT
></DT
><DD
><P
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="90%"
><TR
><TD
><PRE
CLASS="PROGRAMLISTING"
>   1&nbsp;declare -i number
   2&nbsp;# The script will treat subsequent occurrences of "number" as an integer.		
   3&nbsp;
   4&nbsp;number=3
   5&nbsp;echo "number = $number"     # number = 3
   6&nbsp;
   7&nbsp;number=three
   8&nbsp;echo "number = $number"     # number = 0
   9&nbsp;# Tries to evaluate "three" as an integer.</PRE
></TD
></TR
></TABLE
>
		
		Note that certain arithmetic operations are permitted
		for declared integer variables without the need
		for <A
HREF="moreadv.html#EXPRREF"
>expr</A
> or <A
HREF="internal.html#LETREF"
>let</A
>.</P
></DD
><DT
><SPAN
CLASS="TOKEN"
>-a</SPAN
> <TT
CLASS="REPLACEABLE"
><I
>array</I
></TT
></DT
><DD
><P
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="90%"
><TR
><TD
><PRE
CLASS="PROGRAMLISTING"
>   1&nbsp;declare -a indices</PRE
></TD
></TR
></TABLE
></P
><P
>The variable <TT
CLASS="VARNAME"
>indices</TT
> will be treated as
		an array.</P
></DD
><DT
><SPAN
CLASS="TOKEN"
>-f</SPAN
> <TT
CLASS="REPLACEABLE"
><I
>functions</I
></TT
></DT
><DD
><P
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="90%"
><TR
><TD
><PRE
CLASS="PROGRAMLISTING"
>   1&nbsp;declare -f</PRE
></TD
></TR
></TABLE
></P
><P
>A <TT
CLASS="USERINPUT"
><B
>declare -f</B
></TT
> line with no
		arguments in a script causes a listing of all the
		functions previously defined in that script.</P
><P
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="90%"
><TR
><TD
><PRE
CLASS="PROGRAMLISTING"
>   1&nbsp;declare -f function_name</PRE
></TD
></TR
></TABLE
></P
><P
>A <TT
CLASS="USERINPUT"
><B
>declare -f function_name</B
></TT
>
		in a script lists just the function named.</P
></DD
><DT
><SPAN
CLASS="TOKEN"
>-x</SPAN
> <A
HREF="internal.html#EXPORTREF"
>export</A
></DT
><DD
><P
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="90%"
><TR
><TD
><PRE
CLASS="PROGRAMLISTING"
>   1&nbsp;declare -x var3</PRE
></TD
></TR
></TABLE
></P
><P
>This declares a variable as available for exporting outside the
		environment of the script itself.</P
></DD
><DT
>var=$value</DT
><DD
><P
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="90%"
><TR
><TD
><PRE
CLASS="PROGRAMLISTING"
>   1&nbsp;declare -x var3=373</PRE
></TD
></TR
></TABLE
></P
><P
>The <B
CLASS="COMMAND"
>declare</B
> command permits
		  assigning a value to a variable in the same statement
		  as setting its properties.</P
></DD
></DL
></DIV
><DIV
CLASS="EXAMPLE"
><HR><A
NAME="EX20"
></A
><P
><B
>Example 9-17. Using <B
CLASS="COMMAND"
>declare</B
> to type variables</B
></P
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><PRE
CLASS="PROGRAMLISTING"
>   1&nbsp;#!/bin/bash
   2&nbsp;
   3&nbsp;func1 ()
   4&nbsp;{
   5&nbsp;echo This is a function.
   6&nbsp;}
   7&nbsp;
   8&nbsp;declare -f        # Lists the function above.
   9&nbsp;
  10&nbsp;echo
  11&nbsp;
  12&nbsp;declare -i var1   # var1 is an integer.
  13&nbsp;var1=2367
  14&nbsp;echo "var1 declared as $var1"
  15&nbsp;var1=var1+1       # Integer declaration eliminates the need for 'let'.
  16&nbsp;echo "var1 incremented by 1 is $var1."
  17&nbsp;# Attempt to change variable declared as integer
  18&nbsp;echo "Attempting to change var1 to floating point value, 2367.1."
  19&nbsp;var1=2367.1       # Results in error message, with no change to variable.
  20&nbsp;echo "var1 is still $var1"
  21&nbsp;
  22&nbsp;echo
  23&nbsp;
  24&nbsp;declare -r var2=13.36         # 'declare' permits setting a variable property
  25&nbsp;                              #+ and simultaneously assigning it a value.
  26&nbsp;echo "var2 declared as $var2" # Attempt to change readonly variable.
  27&nbsp;var2=13.37                    # Generates error message, and exit from script.
  28&nbsp;
  29&nbsp;echo "var2 is still $var2"    # This line will not execute.
  30&nbsp;
  31&nbsp;exit 0                        # Script will not exit here.</PRE
></TD
></TR
></TABLE
><HR></DIV
></DIV
><DIV
CLASS="NAVFOOTER"
><HR
ALIGN="LEFT"
WIDTH="100%"><TABLE
WIDTH="100%"
BORDER="0"
CELLPADDING="0"
CELLSPACING="0"
><TR
><TD
WIDTH="33%"
ALIGN="left"
VALIGN="top"
><A
HREF="parameter-substitution.html"
>Prev</A
></TD
><TD
WIDTH="34%"
ALIGN="center"
VALIGN="top"
><A
HREF="index.html"
>Home</A
></TD
><TD
WIDTH="33%"
ALIGN="right"
VALIGN="top"
><A
HREF="ivr.html"
>Next</A
></TD
></TR
><TR
><TD
WIDTH="33%"
ALIGN="left"
VALIGN="top"
>Parameter Substitution</TD
><TD
WIDTH="34%"
ALIGN="center"
VALIGN="top"
><A
HREF="variables2.html"
>Up</A
></TD
><TD
WIDTH="33%"
ALIGN="right"
VALIGN="top"
>Indirect References to Variables</TD
></TR
></TABLE
></DIV
></BODY
></HTML
>